#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function AstralTutorial.AstralTutorial_C.ReceiveBeginPlay
struct UAstralTutorial_C_ReceiveBeginPlay_Params
{
};

// Function AstralTutorial.AstralTutorial_C.ReceiveTick
struct UAstralTutorial_C_ReceiveTick_Params
{
	float                                              DeltaSeconds;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AstralTutorial.AstralTutorial_C.Cast
struct UAstralTutorial_C_Cast_Params
{
};

// Function AstralTutorial.AstralTutorial_C.VisibilityServ
struct UAstralTutorial_C_VisibilityServ_Params
{
};

// Function AstralTutorial.AstralTutorial_C.VisibilityMulti
struct UAstralTutorial_C_VisibilityMulti_Params
{
};

// Function AstralTutorial.AstralTutorial_C.AstralOffServ
struct UAstralTutorial_C_AstralOffServ_Params
{
	bool                                               AfterAttack;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function AstralTutorial.AstralTutorial_C.AstralOffMulti
struct UAstralTutorial_C_AstralOffMulti_Params
{
	bool                                               AfterAttack;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function AstralTutorial.AstralTutorial_C.AstralOffLocal
struct UAstralTutorial_C_AstralOffLocal_Params
{
	bool                                               AfterAttack;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function AstralTutorial.AstralTutorial_C.ExecuteUbergraph_AstralTutorial
struct UAstralTutorial_C_ExecuteUbergraph_AstralTutorial_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
