#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function Astral.Astral_C.Visibility Invis Mesh Granny
struct UAstral_C_Visibility_Invis_Mesh_Granny_Params
{
	bool                                               On_;                                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Astral.Astral_C.ReceiveBeginPlay
struct UAstral_C_ReceiveBeginPlay_Params
{
};

// Function Astral.Astral_C.ReceiveTick
struct UAstral_C_ReceiveTick_Params
{
	float                                              DeltaSeconds;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Astral.Astral_C.Cast
struct UAstral_C_Cast_Params
{
};

// Function Astral.Astral_C.VisibilityServ
struct UAstral_C_VisibilityServ_Params
{
};

// Function Astral.Astral_C.VisibilityMulti
struct UAstral_C_VisibilityMulti_Params
{
};

// Function Astral.Astral_C.AstralOffServ
struct UAstral_C_AstralOffServ_Params
{
	bool                                               AfterAttack;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Astral.Astral_C.AstralOffMulti
struct UAstral_C_AstralOffMulti_Params
{
	bool                                               AfterAttack;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Astral.Astral_C.AstralOffLocal
struct UAstral_C_AstralOffLocal_Params
{
	bool                                               AfterAttack;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Astral.Astral_C.Consume
struct UAstral_C_Consume_Params
{
};

// Function Astral.Astral_C.OnInvoke
struct UAstral_C_OnInvoke_Params
{
};

// Function Astral.Astral_C.ExecuteUbergraph_Astral
struct UAstral_C_ExecuteUbergraph_Astral_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
