#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BPA_RHG_Lobby.BPA_RHG_Lobby_C
// 0x2DA5 (FullSize[0x305D] - InheritedSize[0x02B8])
class UBPA_RHG_Lobby_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_S17T[0x8];                                     // 0x02B8(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x02C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                        // 0x02C8(0x0030)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_2;                           // 0x02F8(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16;                         // 0x03A8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_36;                           // 0x03D0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_36;                              // 0x0450(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_35;                           // 0x0480(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_35;                              // 0x0500(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_18;                             // 0x0530(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15;                         // 0x05E0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_34;                           // 0x0608(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_34;                              // 0x0688(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_33;                           // 0x06B8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_33;                              // 0x0738(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_17;                             // 0x0768(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14;                         // 0x0818(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_32;                           // 0x0840(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_32;                              // 0x08C0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_31;                           // 0x08F0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_31;                              // 0x0970(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_16;                             // 0x09A0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13;                         // 0x0A50(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_30;                           // 0x0A78(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_30;                              // 0x0AF8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_29;                           // 0x0B28(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_29;                              // 0x0BA8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_15;                             // 0x0BD8(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12;                         // 0x0C88(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_28;                           // 0x0CB0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_28;                              // 0x0D30(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_27;                           // 0x0D60(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_27;                              // 0x0DE0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_14;                             // 0x0E10(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_26;                           // 0x0EC0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_26;                              // 0x0F40(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_25;                           // 0x0F70(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_25;                              // 0x0FF0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_13;                             // 0x1020(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7;                           // 0x10D0(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum;                             // 0x1170(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11;                         // 0x1220(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_24;                           // 0x1248(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_24;                              // 0x12C8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23;                           // 0x12F8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_23;                              // 0x1378(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_12;                             // 0x13A8(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10;                         // 0x1458(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_22;                           // 0x1480(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_22;                              // 0x1500(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_21;                           // 0x1530(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_21;                              // 0x15B0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_11;                             // 0x15E0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9;                          // 0x1690(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20;                           // 0x16B8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_20;                              // 0x1738(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19;                           // 0x1768(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_19;                              // 0x17E8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_10;                             // 0x1818(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8;                          // 0x18C8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18;                           // 0x18F0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_18;                              // 0x1970(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17;                           // 0x19A0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_17;                              // 0x1A20(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9;                              // 0x1A50(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7;                          // 0x1B00(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_16;                           // 0x1B28(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_16;                              // 0x1BA8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15;                           // 0x1BD8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_15;                              // 0x1C58(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8;                              // 0x1C88(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14;                           // 0x1D38(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_14;                              // 0x1DB8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13;                           // 0x1DE8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_13;                              // 0x1E68(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7;                              // 0x1E98(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6;                           // 0x1F48(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6;                          // 0x1FE8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_12;                           // 0x2010(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_12;                              // 0x2090(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11;                           // 0x20C0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_11;                              // 0x2140(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6;                              // 0x2170(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5;                           // 0x2220(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5;                          // 0x22C0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10;                           // 0x22E8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_10;                              // 0x2368(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9;                            // 0x2398(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9;                               // 0x2418(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5;                              // 0x2448(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4;                           // 0x24F8(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4;                          // 0x2598(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8;                            // 0x25C0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8;                               // 0x2640(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7;                            // 0x2670(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7;                               // 0x26F0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4;                              // 0x2720(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3;                           // 0x27D0(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3;                          // 0x2870(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6;                            // 0x2898(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6;                               // 0x2918(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5;                            // 0x2948(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5;                               // 0x29C8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3;                              // 0x29F8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2;                           // 0x2AA8(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2;                          // 0x2B48(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4;                            // 0x2B70(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4;                               // 0x2BF0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3;                            // 0x2C20(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3;                               // 0x2CA0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2;                              // 0x2CD0(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool;                             // 0x2D80(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                            // 0x2E20(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2;                            // 0x2E48(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2;                               // 0x2EC8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                              // 0x2EF8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                 // 0x2F78(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                                // 0x2FA8(0x00B0)
	TEnumAsByte<SurvChars_ESurvChars>                  SurvChar;                                                  // 0x3058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Reset_;                                                    // 0x3059(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               AmericanFootball_;                                         // 0x305A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsSunshinechris;                                           // 0x305B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsStreetIrArtist;                                          // 0x305C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass BPA_RHG_Lobby.BPA_RHG_Lobby_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_7EA48D264A8073EA1DC357A090A5DDC4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_CE9650B346E9C4A408E4D1A461E83ADE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_691083C34BCC28DEB35F8C87DCCF4E94();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_C32607AC413A92A4CB9F01B2B143653A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_00360D0F4801C0E01E2B6CA19B2F757D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_718E5F1A4D532D4DAEE47489DA524DAA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_F506E56142FB833D6B6AF4B3BC654F56();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_90AFDA004E5411A6716327B0B670240D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_53065F4A4E8C52C979D028AF12271F7C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_CF8AAD2B4396CE0A463661AAC3BE4269();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_5C7169D14048F35A35A841B7D187A3D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_97C47E4A40AF61D907616E969389AA41();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_42759A1842B6EDB0D647D4A0DACF4BB8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_227E00DD4CA9B0AD6773D9BEE60C7B9D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_C73CE4A3453857CEA7E75483A1D81A04();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_C387604448A4B222F5CEC2A61793EA3D();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ResetAnim();
	void Timer();
	void ExecuteUbergraph_BPA_RHG_Lobby(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
