#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BPI_GI_Playfab.BPI_GI_Playfab_C.GetTitlePlayerID
struct UBPI_GI_Playfab_C_GetTitlePlayerID_Params
{
	struct FString                                     ID;                                                        // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPI_GI_Playfab.BPI_GI_Playfab_C.SetTitlePlayerID
struct UBPI_GI_Playfab_C_SetTitlePlayerID_Params
{
	struct FString                                     ID;                                                        // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPI_GI_Playfab.BPI_GI_Playfab_C.GetPlayfabBuildID
struct UBPI_GI_Playfab_C_GetPlayfabBuildID_Params
{
	struct FString                                     BuildId;                                                   // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPI_GI_Playfab.BPI_GI_Playfab_C.GetSteamPlayerID
struct UBPI_GI_Playfab_C_GetSteamPlayerID_Params
{
	struct FString                                     ID;                                                        // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPI_GI_Playfab.BPI_GI_Playfab_C.SetPlayfabUserID
struct UBPI_GI_Playfab_C_SetPlayfabUserID_Params
{
	struct FString                                     UserId;                                                    // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPI_GI_Playfab.BPI_GI_Playfab_C.GetPlayfabUserID
struct UBPI_GI_Playfab_C_GetPlayfabUserID_Params
{
	struct FString                                     UserId;                                                    // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
