#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function CountSurvStatus.CountSurvStatus_C.Get_MaxHealthText_Text_1
struct UCountSurvStatus_C_Get_MaxHealthText_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_HealthProgress_Ally_Additional_Percent_1
struct UCountSurvStatus_C_Get_HealthProgress_Ally_Additional_Percent_1_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get Health Progress Ally Additional Percent
struct UCountSurvStatus_C_Get_Health_Progress_Ally_Additional_Percent_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get Health Progress Ally Small Percent Health Small
struct UCountSurvStatus_C_Get_Health_Progress_Ally_Small_Percent_Health_Small_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get Visibility Additional Health
struct UCountSurvStatus_C_Get_Visibility_Additional_Health_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_HealthProgress_blocked_Percent_1
struct UCountSurvStatus_C_Get_HealthProgress_blocked_Percent_1_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_ProgressBar_AllyOnChair_Percent_1
struct UCountSurvStatus_C_Get_ProgressBar_AllyOnChair_Percent_1_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get Health Progress Ally Percent Main Health Bar
struct UCountSurvStatus_C_Get_Health_Progress_Ally_Percent_Main_Health_Bar_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_HealthProgress_FillColorAndOpacity_1
struct UCountSurvStatus_C_Get_HealthProgress_FillColorAndOpacity_1_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_Item3_Visibility_1
struct UCountSurvStatus_C_Get_Item3_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_Item2_Visibility_1
struct UCountSurvStatus_C_Get_Item2_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_Item1_Visibility_1
struct UCountSurvStatus_C_Get_Item1_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_Item3_Brush_1
struct UCountSurvStatus_C_Get_Item3_Brush_1_Params
{
	struct FSlateBrush                                 ReturnValue;                                               // 0x0000(0x0088)  (Parm, OutParm, ReturnParm)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_Item2_Brush_1
struct UCountSurvStatus_C_Get_Item2_Brush_1_Params
{
	struct FSlateBrush                                 ReturnValue;                                               // 0x0000(0x0088)  (Parm, OutParm, ReturnParm)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_Item1_Brush_1
struct UCountSurvStatus_C_Get_Item1_Brush_1_Params
{
	struct FSlateBrush                                 ReturnValue;                                               // 0x0000(0x0088)  (Parm, OutParm, ReturnParm)
};

// Function CountSurvStatus.CountSurvStatus_C.Get_Items_Visibility_1
struct UCountSurvStatus_C_Get_Items_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Self Reanimate Progress
struct UCountSurvStatus_C_Self_Reanimate_Progress_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.OnChairBlockedTime
struct UCountSurvStatus_C_OnChairBlockedTime_Params
{
};

// Function CountSurvStatus.CountSurvStatus_C.OnChairTime
struct UCountSurvStatus_C_OnChairTime_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.StaminaBar
struct UCountSurvStatus_C_StaminaBar_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.Tick
struct UCountSurvStatus_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.ChangeStatus
struct UCountSurvStatus_C_ChangeStatus_Params
{
	TEnumAsByte<SurvStatusEnum_ESurvStatusEnum>        Status;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.LoadPlayer
struct UCountSurvStatus_C_LoadPlayer_Params
{
	class ASurvivorMasterBP_C*                         SurvActor;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.HealthChange
struct UCountSurvStatus_C_HealthChange_Params
{
};

// Function CountSurvStatus.CountSurvStatus_C.TextColorLerp
struct UCountSurvStatus_C_TextColorLerp_Params
{
};

// Function CountSurvStatus.CountSurvStatus_C.SetIndexStatusCircle
struct UCountSurvStatus_C_SetIndexStatusCircle_Params
{
	int                                                Index;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CountSurvStatus.CountSurvStatus_C.UpdateAllyHealthBar
struct UCountSurvStatus_C_UpdateAllyHealthBar_Params
{
};

// Function CountSurvStatus.CountSurvStatus_C.UpdateAllyAdditionHP
struct UCountSurvStatus_C_UpdateAllyAdditionHP_Params
{
};

// Function CountSurvStatus.CountSurvStatus_C.Construct
struct UCountSurvStatus_C_Construct_Params
{
};

// Function CountSurvStatus.CountSurvStatus_C.StartAnimationHP
struct UCountSurvStatus_C_StartAnimationHP_Params
{
};

// Function CountSurvStatus.CountSurvStatus_C.AnimTick
struct UCountSurvStatus_C_AnimTick_Params
{
};

// Function CountSurvStatus.CountSurvStatus_C.StopAnimHP
struct UCountSurvStatus_C_StopAnimHP_Params
{
};

// Function CountSurvStatus.CountSurvStatus_C.ShowBanner
struct UCountSurvStatus_C_ShowBanner_Params
{
	struct FText                                       HeaderText;                                                // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function CountSurvStatus.CountSurvStatus_C.ExecuteUbergraph_CountSurvStatus
struct UCountSurvStatus_C_ExecuteUbergraph_CountSurvStatus_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
