#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function CustomGraphicButton.CustomGraphicButton_C.DoNavigateRight
struct UCustomGraphicButton_C_DoNavigateRight_Params
{
	SlateCore_EUINavigation                            Navigation;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                     ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CustomGraphicButton.CustomGraphicButton_C.DoNavigateLeft
struct UCustomGraphicButton_C_DoNavigateLeft_Params
{
	SlateCore_EUINavigation                            Navigation;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                     ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CustomGraphicButton.CustomGraphicButton_C.BndEvt__ButtonReFocuser_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
struct UCustomGraphicButton_C_BndEvt__ButtonReFocuser_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.BndEvt__ButtonReFocuser_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
struct UCustomGraphicButton_C_BndEvt__ButtonReFocuser_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.BndEvt__Button_RightClick_3_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature
struct UCustomGraphicButton_C_BndEvt__Button_RightClick_3_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.BndEvt__Button_LeftClick_3_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature
struct UCustomGraphicButton_C_BndEvt__Button_LeftClick_3_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.BndEvt__ButtonReFocuser_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
struct UCustomGraphicButton_C_BndEvt__ButtonReFocuser_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.Select
struct UCustomGraphicButton_C_Select_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.Deselect
struct UCustomGraphicButton_C_Deselect_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.BndEvt__Button_353_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
struct UCustomGraphicButton_C_BndEvt__Button_353_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.BndEvt__Button_138_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UCustomGraphicButton_C_BndEvt__Button_138_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.Tick
struct UCustomGraphicButton_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CustomGraphicButton.CustomGraphicButton_C.Construct
struct UCustomGraphicButton_C_Construct_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.ExecuteUbergraph_CustomGraphicButton
struct UCustomGraphicButton_C_ExecuteUbergraph_CustomGraphicButton_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CustomGraphicButton.CustomGraphicButton_C.OnPressed__DelegateSignature
struct UCustomGraphicButton_C_OnPressed__DelegateSignature_Params
{
	class UCustomGraphicButton_C*                      Button;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CustomGraphicButton.CustomGraphicButton_C.EventDispatcher_FocusedStyle__DelegateSignature
struct UCustomGraphicButton_C_EventDispatcher_FocusedStyle__DelegateSignature_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.EventDispatcher_Right__DelegateSignature
struct UCustomGraphicButton_C_EventDispatcher_Right__DelegateSignature_Params
{
};

// Function CustomGraphicButton.CustomGraphicButton_C.EventDispatcher_Left__DelegateSignature
struct UCustomGraphicButton_C_EventDispatcher_Left__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
