#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function EndGameBP.EndGameBP_C.CameraLerp__FinishedFunc
struct AEndGameBP_C_CameraLerp__FinishedFunc_Params
{
};

// Function EndGameBP.EndGameBP_C.CameraLerp__UpdateFunc
struct AEndGameBP_C_CameraLerp__UpdateFunc_Params
{
};

// Function EndGameBP.EndGameBP_C.KillerCameraLerp__FinishedFunc
struct AEndGameBP_C_KillerCameraLerp__FinishedFunc_Params
{
};

// Function EndGameBP.EndGameBP_C.KillerCameraLerp__UpdateFunc
struct AEndGameBP_C_KillerCameraLerp__UpdateFunc_Params
{
};

// Function EndGameBP.EndGameBP_C.NewEndGameTimeline__FinishedFunc
struct AEndGameBP_C_NewEndGameTimeline__FinishedFunc_Params
{
};

// Function EndGameBP.EndGameBP_C.NewEndGameTimeline__UpdateFunc
struct AEndGameBP_C_NewEndGameTimeline__UpdateFunc_Params
{
};

// Function EndGameBP.EndGameBP_C.InpActEvt_NumPadOne_K2Node_InputKeyEvent_7
struct AEndGameBP_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_7_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function EndGameBP.EndGameBP_C.InpActEvt_NumPadTwo_K2Node_InputKeyEvent_6
struct AEndGameBP_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_6_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function EndGameBP.EndGameBP_C.InpActEvt_NumPadThree_K2Node_InputKeyEvent_5
struct AEndGameBP_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_5_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function EndGameBP.EndGameBP_C.InpActEvt_NumPadFour_K2Node_InputKeyEvent_4
struct AEndGameBP_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_4_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function EndGameBP.EndGameBP_C.InpActEvt_NumPadFive_K2Node_InputKeyEvent_3
struct AEndGameBP_C_InpActEvt_NumPadFive_K2Node_InputKeyEvent_3_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function EndGameBP.EndGameBP_C.InpActEvt_NumPadSix_K2Node_InputKeyEvent_2
struct AEndGameBP_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_2_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function EndGameBP.EndGameBP_C.InpActEvt_NumPadSeven_K2Node_InputKeyEvent_1
struct AEndGameBP_C_InpActEvt_NumPadSeven_K2Node_InputKeyEvent_1_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function EndGameBP.EndGameBP_C.TestEndGame
struct AEndGameBP_C_TestEndGame_Params
{
	bool                                               On_;                                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function EndGameBP.EndGameBP_C.StartLerpCamera
struct AEndGameBP_C_StartLerpCamera_Params
{
};

// Function EndGameBP.EndGameBP_C.CameraLocChange
struct AEndGameBP_C_CameraLocChange_Params
{
};

// Function EndGameBP.EndGameBP_C.AlarmsEvMulti
struct AEndGameBP_C_AlarmsEvMulti_Params
{
};

// Function EndGameBP.EndGameBP_C.AlarmsEvent
struct AEndGameBP_C_AlarmsEvent_Params
{
	bool                                               AllOff_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function EndGameBP.EndGameBP_C.SwitchChairVisibilityServer
struct AEndGameBP_C_SwitchChairVisibilityServer_Params
{
	struct FString                                     PlayerSlot;                                                // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                               Dead_;                                                     // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function EndGameBP.EndGameBP_C.EndGameVisibility
struct AEndGameBP_C_EndGameVisibility_Params
{
	bool                                               SurvWin_;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function EndGameBP.EndGameBP_C.SwitchChairVisibility
struct AEndGameBP_C_SwitchChairVisibility_Params
{
	struct FString                                     PlayerSlot;                                                // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                               Dead_;                                                     // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function EndGameBP.EndGameBP_C.LookAtEvent
struct AEndGameBP_C_LookAtEvent_Params
{
};

// Function EndGameBP.EndGameBP_C.TeleportEndGame
struct AEndGameBP_C_TeleportEndGame_Params
{
	class AActor*                                      Actor;                                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FString                                     LobbySlotName;                                             // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                               Dead_;                                                     // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               NotChair_;                                                 // 0x0019(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function EndGameBP.EndGameBP_C.ReceiveTick
struct AEndGameBP_C_ReceiveTick_Params
{
	float                                              DeltaSeconds;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EndGameBP.EndGameBP_C.ReceiveBeginPlay
struct AEndGameBP_C_ReceiveBeginPlay_Params
{
};

// Function EndGameBP.EndGameBP_C.EndGameTypeSet
struct AEndGameBP_C_EndGameTypeSet_Params
{
	bool                                               SurvWin_;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int                                                EndGameType;                                               // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EndGameBP.EndGameBP_C.ChangeFOV
struct AEndGameBP_C_ChangeFOV_Params
{
	bool                                               On_;                                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function EndGameBP.EndGameBP_C.KillerCamera
struct AEndGameBP_C_KillerCamera_Params
{
};

// Function EndGameBP.EndGameBP_C.SurvCamera
struct AEndGameBP_C_SurvCamera_Params
{
};

// Function EndGameBP.EndGameBP_C.VisibleMeshOff
struct AEndGameBP_C_VisibleMeshOff_Params
{
};

// Function EndGameBP.EndGameBP_C.NewEndGame
struct AEndGameBP_C_NewEndGame_Params
{
};

// Function EndGameBP.EndGameBP_C.HideActors
struct AEndGameBP_C_HideActors_Params
{
	bool                                               Hide_;                                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function EndGameBP.EndGameBP_C.ExecuteUbergraph_EndGameBP
struct AEndGameBP_C_ExecuteUbergraph_EndGameBP_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
