#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass FP_Vampire_Skeleton_AnimBlueprint.FP_Vampire_Skeleton_AnimBlueprint_C
// 0x1A03 (FullSize[0x1CBB] - InheritedSize[0x02B8])
class UFP_Vampire_Skeleton_AnimBlueprint_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_GSEY[0x8];                                     // 0x02B8(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x02C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3;                           // 0x02C8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18;                           // 0x0368(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47;                         // 0x03E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46;                         // 0x0410(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_45;                         // 0x0438(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44;                         // 0x0460(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43;                         // 0x0488(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42;                         // 0x04B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41;                         // 0x04D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40;                         // 0x0500(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_39;                         // 0x0528(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_38;                         // 0x0550(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37;                         // 0x0578(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_36;                         // 0x05A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35;                         // 0x05C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_34;                         // 0x05F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33;                         // 0x0618(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32;                         // 0x0640(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_31;                         // 0x0668(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30;                         // 0x0690(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_29;                         // 0x06B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_28;                         // 0x06E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27;                         // 0x0708(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_26;                         // 0x0730(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_25;                         // 0x0758(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_24;                         // 0x0780(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23;                         // 0x07A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22;                         // 0x07D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21;                         // 0x07F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_20;                         // 0x0820(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19;                         // 0x0848(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_18;                         // 0x0870(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17;                         // 0x0898(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16;                         // 0x08C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15;                         // 0x08E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14;                         // 0x0910(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13;                         // 0x0938(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12;                         // 0x0960(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11;                         // 0x0988(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10;                         // 0x09B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9;                          // 0x09D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8;                          // 0x0A00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7;                          // 0x0A28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6;                          // 0x0A50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5;                          // 0x0A78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4;                          // 0x0AA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3;                          // 0x0AC8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17;                           // 0x0AF0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_16;                              // 0x0B70(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_16;                           // 0x0BA0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_15;                              // 0x0C20(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15;                           // 0x0C50(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_14;                              // 0x0CD0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14;                           // 0x0D00(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_13;                              // 0x0D80(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13;                           // 0x0DB0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_12;                              // 0x0E30(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_12;                           // 0x0E60(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_11;                              // 0x0EE0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11;                           // 0x0F10(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_10;                              // 0x0F90(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10;                           // 0x0FC0(0x0080)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt;                              // 0x1040(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9;                            // 0x10E0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9;                               // 0x1160(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer;                            // 0x1190(0x00E8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8;                               // 0x1278(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8;                            // 0x12A8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7;                               // 0x1328(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7;                            // 0x1358(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6;                               // 0x13D8(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2;                           // 0x1408(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6;                            // 0x14A8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5;                            // 0x1528(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5;                               // 0x15A8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4;                            // 0x15D8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4;                               // 0x1658(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2;                              // 0x1688(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool;                             // 0x1738(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2;                          // 0x17D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                            // 0x1800(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3;                            // 0x1828(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3;                               // 0x18A8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2;                            // 0x18D8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2;                               // 0x1958(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                              // 0x1988(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                 // 0x1A08(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                                // 0x1A38(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose;                              // 0x1AE8(0x0158)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                        // 0x1C40(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose;                               // 0x1C70(0x0028)
	float                                              keepSurv;                                                  // 0x1C98(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsInAir;                                                   // 0x1C9C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_VNO2[0x3];                                     // 0x1C9D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Speed;                                                     // 0x1CA0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Direction;                                                 // 0x1CA4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               PropHunt_;                                                 // 0x1CA8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               AttackBool;                                                // 0x1CA9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               JumpEndChek;                                               // 0x1CAA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               FIRE;                                                      // 0x1CAB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Plant;                                                     // 0x1CAC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               MarioStun;                                                 // 0x1CAD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Flashed;                                                   // 0x1CAE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Broke_Anim;                                                // 0x1CAF(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int                                                TypeAttack;                                                // 0x1CB0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Delta_Time_X;                                              // 0x1CB4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Alt_Attack_;                                               // 0x1CB8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Active_Spell_1_;                                           // 0x1CB9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               vs3;                                                       // 0x1CBA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass FP_Vampire_Skeleton_AnimBlueprint.FP_Vampire_Skeleton_AnimBlueprint_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_68B4473744AC5E7A37913EB8A7FC1282();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_5E04F4AD4233D6B7C6781E8807389A82();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0626F8F24AE7BE78B4CF609861EC2DBF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_7F7E851349742C9DB16019B4F283556D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_BlendListByBool_6F93BBDB48A08F69E58F809912031B15();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_6F6C24254D6653C3850F5F9475BE1FF8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_E592B28A48CF899973AC9D9A838B28C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_27CB73B240D080105F994882CD484350();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3F0B6D574A0A8898AC51F18F24F8D473();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_5A8C93784A25E4B957A94EB1E77BD818();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_E96A05B4459E8EF167721BA4EE0EAB5B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_43835B1E425CB74A2EF7228208EA720C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_CFE9FC224AE3A508A08200B5091906B6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_B3658EF247941C44F15DC49961744327();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_CDAEDA2E4933624A6C9BCF910BA5838A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_981581A4499549D4DBDD57B029239D0B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_EDDD52D74FE7EFE93FF4978E8E5F7CD0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_FC7E19174D19009E5F9DCDA8B0208DCF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_BD635E2444F2086E75FC26A418C2E4E9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_05878C17498F7DA5BFE3F69BE8C66240();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2531E8E2448E191987FB1783E52D0128();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C9C9BEED4991BA02FA6781A43A688AA2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_29C9DB414333F1C4E96DC5A6838C8F4E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_503E3540482D7AAF3BFD49B977E632C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2916D70D488EB4AAC2B3FBB0FE6DEA20();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_FP_Vampire_Skeleton_AnimBlueprint(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
