#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass FPGrannyAnimBP.FPGrannyAnimBP_C
// 0x31A9 (FullSize[0x3461] - InheritedSize[0x02B8])
class UFPGrannyAnimBP_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_KS1W[0x8];                                     // 0x02B8(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x02C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                        // 0x02C8(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_127;                        // 0x02F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_126;                        // 0x0320(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_125;                        // 0x0348(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_124;                        // 0x0370(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_123;                        // 0x0398(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_122;                        // 0x03C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_121;                        // 0x03E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_120;                        // 0x0410(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_119;                        // 0x0438(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_118;                        // 0x0460(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_117;                        // 0x0488(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_116;                        // 0x04B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_115;                        // 0x04D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_114;                        // 0x0500(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_113;                        // 0x0528(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_112;                        // 0x0550(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_111;                        // 0x0578(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_110;                        // 0x05A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_109;                        // 0x05C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_108;                        // 0x05F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_107;                        // 0x0618(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_106;                        // 0x0640(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_105;                        // 0x0668(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_104;                        // 0x0690(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_103;                        // 0x06B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_102;                        // 0x06E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_101;                        // 0x0708(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_100;                        // 0x0730(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_99;                         // 0x0758(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98;                         // 0x0780(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_97;                         // 0x07A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_96;                         // 0x07D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_95;                         // 0x07F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94;                         // 0x0820(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93;                         // 0x0848(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_92;                         // 0x0870(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91;                         // 0x0898(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_90;                         // 0x08C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_89;                         // 0x08E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88;                         // 0x0910(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87;                         // 0x0938(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_86;                         // 0x0960(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_85;                         // 0x0988(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_84;                         // 0x09B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83;                         // 0x09D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_82;                         // 0x0A00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_81;                         // 0x0A28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_80;                         // 0x0A50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_79;                         // 0x0A78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_78;                         // 0x0AA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77;                         // 0x0AC8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_76;                         // 0x0AF0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_75;                         // 0x0B18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_74;                         // 0x0B40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73;                         // 0x0B68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_72;                         // 0x0B90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71;                         // 0x0BB8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_70;                         // 0x0BE0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69;                         // 0x0C08(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_68;                         // 0x0C30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67;                         // 0x0C58(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_66;                         // 0x0C80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_65;                         // 0x0CA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64;                         // 0x0CD0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63;                         // 0x0CF8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62;                         // 0x0D20(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_61;                         // 0x0D48(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60;                         // 0x0D70(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_59;                         // 0x0D98(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_58;                         // 0x0DC0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_57;                         // 0x0DE8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_56;                         // 0x0E10(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_55;                         // 0x0E38(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54;                         // 0x0E60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53;                         // 0x0E88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52;                         // 0x0EB0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51;                         // 0x0ED8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50;                         // 0x0F00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_49;                         // 0x0F28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48;                         // 0x0F50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47;                         // 0x0F78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46;                         // 0x0FA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_45;                         // 0x0FC8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44;                         // 0x0FF0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43;                         // 0x1018(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42;                         // 0x1040(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41;                         // 0x1068(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40;                         // 0x1090(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_39;                         // 0x10B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_38;                         // 0x10E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37;                         // 0x1108(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_36;                         // 0x1130(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35;                         // 0x1158(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_34;                         // 0x1180(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33;                         // 0x11A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32;                         // 0x11D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_31;                         // 0x11F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30;                         // 0x1220(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_29;                         // 0x1248(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_28;                         // 0x1270(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27;                         // 0x1298(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_26;                         // 0x12C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_25;                         // 0x12E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_24;                         // 0x1310(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23;                         // 0x1338(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22;                         // 0x1360(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21;                         // 0x1388(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_20;                         // 0x13B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19;                         // 0x13D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_18;                         // 0x1400(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17;                         // 0x1428(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16;                         // 0x1450(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15;                         // 0x1478(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14;                         // 0x14A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13;                         // 0x14C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12;                         // 0x14F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11;                         // 0x1518(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10;                         // 0x1540(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9;                          // 0x1568(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8;                          // 0x1590(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7;                          // 0x15B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6;                          // 0x15E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5;                          // 0x1608(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4;                          // 0x1630(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3;                          // 0x1658(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2;                          // 0x1680(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                            // 0x16A8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_32;                           // 0x16D0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_22;                              // 0x1750(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_31;                           // 0x1780(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_21;                              // 0x1800(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_30;                           // 0x1830(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_20;                              // 0x18B0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_29;                           // 0x18E0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_19;                              // 0x1960(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_28;                           // 0x1990(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_18;                              // 0x1A10(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_27;                           // 0x1A40(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_17;                              // 0x1AC0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_26;                           // 0x1AF0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_16;                              // 0x1B70(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_25;                           // 0x1BA0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_15;                              // 0x1C20(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_24;                           // 0x1C50(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_14;                              // 0x1CD0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23;                           // 0x1D00(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_13;                              // 0x1D80(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_22;                           // 0x1DB0(0x0080)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_2;                            // 0x1E30(0x00A0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_5;                               // 0x1ED0(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_21;                           // 0x1F98(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20;                           // 0x2018(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_12;                              // 0x2098(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19;                           // 0x20C8(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4;                           // 0x2148(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18;                           // 0x21E8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_11;                              // 0x2268(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17;                           // 0x2298(0x0080)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_4;                               // 0x2318(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_16;                           // 0x23E0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_10;                              // 0x2460(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15;                           // 0x2490(0x0080)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_3;                               // 0x2510(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14;                           // 0x25D8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9;                               // 0x2658(0x0030)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_2;                               // 0x2688(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13;                           // 0x2750(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_12;                           // 0x27D0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8;                               // 0x2850(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11;                           // 0x2880(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7;                               // 0x2900(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10;                           // 0x2930(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6;                               // 0x29B0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9;                            // 0x29E0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5;                               // 0x2A60(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8;                            // 0x2A90(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3;                           // 0x2B10(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7;                            // 0x2BB0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4;                               // 0x2C30(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6;                            // 0x2C60(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5;                            // 0x2CE0(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2;                           // 0x2D60(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool;                             // 0x2E00(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4;                            // 0x2EA0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3;                               // 0x2F20(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3;                            // 0x2F50(0x0080)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt;                              // 0x2FD0(0x00A0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend;                                 // 0x3070(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2;                            // 0x3138(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                              // 0x31B8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2;                               // 0x3238(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer;                            // 0x3268(0x00E8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                 // 0x3350(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                                // 0x3380(0x00B0)
	float                                              keepSurv;                                                  // 0x3430(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               IsInAir;                                                   // 0x3434(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_Q0JA[0x3];                                     // 0x3435(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Speed;                                                     // 0x3438(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               AttackBool;                                                // 0x343C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               JumpEndChek;                                               // 0x343D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               FIRE;                                                      // 0x343E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Plant;                                                     // 0x343F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               KnifeIn;                                                   // 0x3440(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               KnifeSpawn;                                                // 0x3441(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_OCMU[0x2];                                     // 0x3442(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Direction;                                                 // 0x3444(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               MarioStun;                                                 // 0x3448(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_8DZS[0x3];                                     // 0x3449(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                TypeAttack;                                                // 0x344C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Astral;                                                    // 0x3450(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Flashed;                                                   // 0x3451(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               PropHunt_;                                                 // 0x3452(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_9L71[0x1];                                     // 0x3453(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              SpeedRateF;                                                // 0x3454(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              TimeRun;                                                   // 0x3458(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Delta_Time_X;                                              // 0x345C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Broke_Anim;                                                // 0x3460(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass FPGrannyAnimBP.FPGrannyAnimBP_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void SpeedRate();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPGrannyAnimBP_AnimGraphNode_TransitionResult_2FEDD8214876E817977A54BAB221CE76();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPGrannyAnimBP_AnimGraphNode_TransitionResult_56382B3F41AAF45CF0CFD49897FB9541();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPGrannyAnimBP_AnimGraphNode_TransitionResult_DD013FC2441954F7BC1FE9AEF1249339();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPGrannyAnimBP_AnimGraphNode_TransitionResult_DBB0E9E04CB00DAE4445F19F8D23A19D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPGrannyAnimBP_AnimGraphNode_TransitionResult_FBD6842A47DE56ABC5E442BA14732F28();
