#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function GeneralSettingWBP.GeneralSettingWBP_C.GetPercent_1
struct UGeneralSettingWBP_C_GetPercent_1_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.LastKnowFocus
struct UGeneralSettingWBP_C_LastKnowFocus_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.DoCustomNavigation_Audio
struct UGeneralSettingWBP_C_DoCustomNavigation_Audio_Params
{
	SlateCore_EUINavigation                            Navigation;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.DoCustomNavigation_Conrol
struct UGeneralSettingWBP_C_DoCustomNavigation_Conrol_Params
{
	SlateCore_EUINavigation                            Navigation;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.DoCustomNavigation_Graphic
struct UGeneralSettingWBP_C_DoCustomNavigation_Graphic_Params
{
	SlateCore_EUINavigation                            Navigation;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               NotPlaySound;                                              // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Back_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Back_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Select_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Select_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Select_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Select_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Select_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Select_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_211_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_211_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.Construct
struct UGeneralSettingWBP_C_Construct_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.CustomEvent_1
struct UGeneralSettingWBP_C_CustomEvent_1_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.DefaultFocusedButtonStyle
struct UGeneralSettingWBP_C_DefaultFocusedButtonStyle_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.OnMouseEnter
struct UGeneralSettingWBP_C_OnMouseEnter_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                               MouseEvent;                                                // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.OnMouseLeave
struct UGeneralSettingWBP_C_OnMouseLeave_Params
{
	struct FPointerEvent                               MouseEvent;                                                // 0x0000(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.FocusMainButtons
struct UGeneralSettingWBP_C_FocusMainButtons_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.PreConstruct
struct UGeneralSettingWBP_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.Tick
struct UGeneralSettingWBP_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_283_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_283_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_Graphic_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_Graphic_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_Control_K2Node_ComponentBoundEvent_10_OnButtonPressedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_Control_K2Node_ComponentBoundEvent_10_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_Audio_K2Node_ComponentBoundEvent_12_OnButtonPressedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_Audio_K2Node_ComponentBoundEvent_12_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.PressE
struct UGeneralSettingWBP_C_PressE_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.PressQ
struct UGeneralSettingWBP_C_PressQ_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.PressedE
struct UGeneralSettingWBP_C_PressedE_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.PressedQ
struct UGeneralSettingWBP_C_PressedQ_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_1_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_1_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_283_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_283_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__Button_283_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__Button_283_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.PlayShowAnim
struct UGeneralSettingWBP_C_PlayShowAnim_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.PlayHideAnim
struct UGeneralSettingWBP_C_PlayHideAnim_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.HideInstantly
struct UGeneralSettingWBP_C_HideInstantly_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.ShowInstantly
struct UGeneralSettingWBP_C_ShowInstantly_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__GeneralSettingWBP_Button_DefaultCfg_K2Node_ComponentBoundEvent_18_OnButtonPressedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__GeneralSettingWBP_Button_DefaultCfg_K2Node_ComponentBoundEvent_18_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__GeneralSettingWBP_Button_DefaultCfg_K2Node_ComponentBoundEvent_19_OnButtonReleasedEvent__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__GeneralSettingWBP_Button_DefaultCfg_K2Node_ComponentBoundEvent_19_OnButtonReleasedEvent__DelegateSignature_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.InitLanguageSelector
struct UGeneralSettingWBP_C_InitLanguageSelector_Params
{
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.BndEvt__GeneralSettingWBP_WBP_CustomComboBox_K2Node_ComponentBoundEvent_20_OnEntryClicked__DelegateSignature
struct UGeneralSettingWBP_C_BndEvt__GeneralSettingWBP_WBP_CustomComboBox_K2Node_ComponentBoundEvent_20_OnEntryClicked__DelegateSignature_Params
{
	struct FText                                       EntryName;                                                 // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	int                                                EntryIndex;                                                // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GeneralSettingWBP.GeneralSettingWBP_C.ExecuteUbergraph_GeneralSettingWBP
struct UGeneralSettingWBP_C_ExecuteUbergraph_GeneralSettingWBP_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
