#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function GrannyAstral.GrannyAstral_C.ReceiveBeginPlay
struct UGrannyAstral_C_ReceiveBeginPlay_Params
{
};

// Function GrannyAstral.GrannyAstral_C.ReceiveTick
struct UGrannyAstral_C_ReceiveTick_Params
{
	float                                              DeltaSeconds;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GrannyAstral.GrannyAstral_C.Cast
struct UGrannyAstral_C_Cast_Params
{
};

// Function GrannyAstral.GrannyAstral_C.VisibilityKillerServer
struct UGrannyAstral_C_VisibilityKillerServer_Params
{
	bool                                               SkillActive_;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GrannyAstral.GrannyAstral_C.VisibilityKillerMulticast
struct UGrannyAstral_C_VisibilityKillerMulticast_Params
{
	bool                                               SkillActive_;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GrannyAstral.GrannyAstral_C.TeleportCurrentPosition
struct UGrannyAstral_C_TeleportCurrentPosition_Params
{
};

// Function GrannyAstral.GrannyAstral_C.TeleportOldPosition
struct UGrannyAstral_C_TeleportOldPosition_Params
{
};

// Function GrannyAstral.GrannyAstral_C.TeleportOldPositionActivate
struct UGrannyAstral_C_TeleportOldPositionActivate_Params
{
};

// Function GrannyAstral.GrannyAstral_C.TeleportNewPositionActivate
struct UGrannyAstral_C_TeleportNewPositionActivate_Params
{
};

// Function GrannyAstral.GrannyAstral_C.DestroySpawnedMeshServer
struct UGrannyAstral_C_DestroySpawnedMeshServer_Params
{
};

// Function GrannyAstral.GrannyAstral_C.DestroySpawnedMeshMulticast
struct UGrannyAstral_C_DestroySpawnedMeshMulticast_Params
{
};

// Function GrannyAstral.GrannyAstral_C.TeleportKillerServer
struct UGrannyAstral_C_TeleportKillerServer_Params
{
};

// Function GrannyAstral.GrannyAstral_C.TeleportKillerMulticast
struct UGrannyAstral_C_TeleportKillerMulticast_Params
{
};

// Function GrannyAstral.GrannyAstral_C.CameraPPChanger
struct UGrannyAstral_C_CameraPPChanger_Params
{
	bool                                               On_;                                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GrannyAstral.GrannyAstral_C.InvisibleEvent
struct UGrannyAstral_C_InvisibleEvent_Params
{
	float                                              DeltaTime;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GrannyAstral.GrannyAstral_C.OnInvoke
struct UGrannyAstral_C_OnInvoke_Params
{
};

// Function GrannyAstral.GrannyAstral_C.Consume
struct UGrannyAstral_C_Consume_Params
{
};

// Function GrannyAstral.GrannyAstral_C.ExecuteUbergraph_GrannyAstral
struct UGrannyAstral_C_ExecuteUbergraph_GrannyAstral_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
