#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function Granny.Granny_C.AstralTimeline__FinishedFunc
struct AGranny_C_AstralTimeline__FinishedFunc_Params
{
};

// Function Granny.Granny_C.AstralTimeline__UpdateFunc
struct AGranny_C_AstralTimeline__UpdateFunc_Params
{
};

// Function Granny.Granny_C.Timeline_6_0__FinishedFunc
struct AGranny_C_Timeline_6_0__FinishedFunc_Params
{
};

// Function Granny.Granny_C.Timeline_6_0__UpdateFunc
struct AGranny_C_Timeline_6_0__UpdateFunc_Params
{
};

// Function Granny.Granny_C.InpActEvt_Use Skill 1_K2Node_InputActionEvent_4
struct AGranny_C_InpActEvt_Use_Skill_1_K2Node_InputActionEvent_4_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function Granny.Granny_C.InpActEvt_Use Skill 2_K2Node_InputActionEvent_3
struct AGranny_C_InpActEvt_Use_Skill_2_K2Node_InputActionEvent_3_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function Granny.Granny_C.InpActEvt_Attack_K2Node_InputActionEvent_2
struct AGranny_C_InpActEvt_Attack_K2Node_InputActionEvent_2_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function Granny.Granny_C.InpActEvt_Use Skill 3_K2Node_InputActionEvent_1
struct AGranny_C_InpActEvt_Use_Skill_3_K2Node_InputActionEvent_1_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function Granny.Granny_C.ReceiveBeginPlay
struct AGranny_C_ReceiveBeginPlay_Params
{
};

// Function Granny.Granny_C.CD_Widget_Strat
struct AGranny_C_CD_Widget_Strat_Params
{
	struct FString                                     AbilityName;                                               // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function Granny.Granny_C.KnifeServ
struct AGranny_C_KnifeServ_Params
{
	struct FVector                                     NewParam;                                                  // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Granny.Granny_C.KnifeMulti
struct AGranny_C_KnifeMulti_Params
{
	struct FVector                                     NewParam;                                                  // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Granny.Granny_C.KnifeDetmulti
struct AGranny_C_KnifeDetmulti_Params
{
};

// Function Granny.Granny_C.KnifeDetServ
struct AGranny_C_KnifeDetServ_Params
{
};

// Function Granny.Granny_C.AtackAudio
struct AGranny_C_AtackAudio_Params
{
};

// Function Granny.Granny_C.WeaponImpact
struct AGranny_C_WeaponImpact_Params
{
	class UStaticMeshComponent*                        meshRef;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Granny.Granny_C.WeaponImpactServ
struct AGranny_C_WeaponImpactServ_Params
{
	class UStaticMeshComponent*                        Mesh;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Granny.Granny_C.WeaponImpactMulti
struct AGranny_C_WeaponImpactMulti_Params
{
	class UStaticMeshComponent*                        Mesh;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Granny.Granny_C.KnifeDetectorSoundTrue
struct AGranny_C_KnifeDetectorSoundTrue_Params
{
};

// Function Granny.Granny_C.KnifeDetectorSoundFalse
struct AGranny_C_KnifeDetectorSoundFalse_Params
{
};

// Function Granny.Granny_C.KnifeShootSoundStart
struct AGranny_C_KnifeShootSoundStart_Params
{
};

// Function Granny.Granny_C.KnifeSpawnSound
struct AGranny_C_KnifeSpawnSound_Params
{
};

// Function Granny.Granny_C.AstralSoundIn
struct AGranny_C_AstralSoundIn_Params
{
};

// Function Granny.Granny_C.AstralSoundInvisibility
struct AGranny_C_AstralSoundInvisibility_Params
{
};

// Function Granny.Granny_C.AstralSoundOut
struct AGranny_C_AstralSoundOut_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Granny.Granny_C.StartAnimShot
struct AGranny_C_StartAnimShot_Params
{
};

// Function Granny.Granny_C.StartAnimShotServ
struct AGranny_C_StartAnimShotServ_Params
{
};

// Function Granny.Granny_C.StartAnimShotMulti
struct AGranny_C_StartAnimShotMulti_Params
{
};

// Function Granny.Granny_C.Atack Audio Serv
struct AGranny_C_Atack_Audio_Serv_Params
{
};

// Function Granny.Granny_C.AtackAudioMulti
struct AGranny_C_AtackAudioMulti_Params
{
};

// Function Granny.Granny_C.AstralTeleportFinish
struct AGranny_C_AstralTeleportFinish_Params
{
};

// Function Granny.Granny_C.AstralSoundOutServ
struct AGranny_C_AstralSoundOutServ_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Granny.Granny_C.AstralSoundOutMulti
struct AGranny_C_AstralSoundOutMulti_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Granny.Granny_C.PickUp Multi
struct AGranny_C_PickUp_Multi_Params
{
	class ASurvivorMasterBP_C*                         SurvRef;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Granny.Granny_C.KillerCatchSound
struct AGranny_C_KillerCatchSound_Params
{
};

// Function Granny.Granny_C.KillerLaugh
struct AGranny_C_KillerLaugh_Params
{
};

// Function Granny.Granny_C.JumpSoundKillerMulti
struct AGranny_C_JumpSoundKillerMulti_Params
{
};

// Function Granny.Granny_C.AfterJumpMulti
struct AGranny_C_AfterJumpMulti_Params
{
};

// Function Granny.Granny_C.BlindSound
struct AGranny_C_BlindSound_Params
{
};

// Function Granny.Granny_C.SurvRunawaySound
struct AGranny_C_SurvRunawaySound_Params
{
};

// Function Granny.Granny_C.DropMulti
struct AGranny_C_DropMulti_Params
{
};

// Function Granny.Granny_C.ToChairMulti
struct AGranny_C_ToChairMulti_Params
{
	class AHypnoChairBP_C*                             NewParam;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Granny.Granny_C.SurvRunAwayMulti
struct AGranny_C_SurvRunAwayMulti_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ASurvivorMasterBP_C*                         hellpSurv;                                                 // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Flashed_;                                                  // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Granny.Granny_C.CheckMoveServer
struct AGranny_C_CheckMoveServer_Params
{
	bool                                               On_;                                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Granny.Granny_C.AstralPostProcess
struct AGranny_C_AstralPostProcess_Params
{
	bool                                               On_;                                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Granny.Granny_C.CreateChildPPMaterial
struct AGranny_C_CreateChildPPMaterial_Params
{
};

// Function Granny.Granny_C.ThirdPersonCamEvent
struct AGranny_C_ThirdPersonCamEvent_Params
{
	bool                                               Now_;                                                      // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               NoDelay_;                                                  // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Granny.Granny_C.FirstPersonCamEvent
struct AGranny_C_FirstPersonCamEvent_Params
{
	bool                                               Now_;                                                      // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               NoDelay_;                                                  // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Granny.Granny_C.KillerDetectMulti
struct AGranny_C_KillerDetectMulti_Params
{
};

// Function Granny.Granny_C.DelayOffMulti
struct AGranny_C_DelayOffMulti_Params
{
};

// Function Granny.Granny_C.SeekMulti
struct AGranny_C_SeekMulti_Params
{
};

// Function Granny.Granny_C.Perexod
struct AGranny_C_Perexod_Params
{
};

// Function Granny.Granny_C.MineKnifeSpawningSound
struct AGranny_C_MineKnifeSpawningSound_Params
{
};

// Function Granny.Granny_C.MineKnifeSpawningSoundServ
struct AGranny_C_MineKnifeSpawningSoundServ_Params
{
};

// Function Granny.Granny_C.MineKnifeSpawningSoundMulti
struct AGranny_C_MineKnifeSpawningSoundMulti_Params
{
};

// Function Granny.Granny_C.JumpSoundKillerLocal
struct AGranny_C_JumpSoundKillerLocal_Params
{
};

// Function Granny.Granny_C.MeshVisibiltyOff
struct AGranny_C_MeshVisibiltyOff_Params
{
};

// Function Granny.Granny_C.MeshVisibilityOn
struct AGranny_C_MeshVisibilityOn_Params
{
};

// Function Granny.Granny_C.AstralSoundInServ
struct AGranny_C_AstralSoundInServ_Params
{
};

// Function Granny.Granny_C.AstralSoundInMulti
struct AGranny_C_AstralSoundInMulti_Params
{
};

// Function Granny.Granny_C.AstralSoundInvisibiltyServ
struct AGranny_C_AstralSoundInvisibiltyServ_Params
{
};

// Function Granny.Granny_C.AstralSoundInvisibilityMulti
struct AGranny_C_AstralSoundInvisibilityMulti_Params
{
};

// Function Granny.Granny_C.ExecuteUbergraph_Granny
struct AGranny_C_ExecuteUbergraph_Granny_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
