#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function IconAbilityCooldownWBP_Doppelganger_Middle.IconAbilityCooldownWBP_Doppelganger_Middle_C.GetText_2
struct UIconAbilityCooldownWBP_Doppelganger_Middle_C_GetText_2_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function IconAbilityCooldownWBP_Doppelganger_Middle.IconAbilityCooldownWBP_Doppelganger_Middle_C.GetText_1
struct UIconAbilityCooldownWBP_Doppelganger_Middle_C_GetText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function IconAbilityCooldownWBP_Doppelganger_Middle.IconAbilityCooldownWBP_Doppelganger_Middle_C.Construct
struct UIconAbilityCooldownWBP_Doppelganger_Middle_C_Construct_Params
{
};

// Function IconAbilityCooldownWBP_Doppelganger_Middle.IconAbilityCooldownWBP_Doppelganger_Middle_C.Tick
struct UIconAbilityCooldownWBP_Doppelganger_Middle_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function IconAbilityCooldownWBP_Doppelganger_Middle.IconAbilityCooldownWBP_Doppelganger_Middle_C.ExecuteUbergraph_IconAbilityCooldownWBP_Doppelganger_Middle
struct UIconAbilityCooldownWBP_Doppelganger_Middle_C_ExecuteUbergraph_IconAbilityCooldownWBP_Doppelganger_Middle_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
