#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function IntroRail.IntroRail_C.StartTimeline__FinishedFunc
struct AIntroRail_C_StartTimeline__FinishedFunc_Params
{
};

// Function IntroRail.IntroRail_C.StartTimeline__UpdateFunc
struct AIntroRail_C_StartTimeline__UpdateFunc_Params
{
};

// Function IntroRail.IntroRail_C.NicknameToggle
struct AIntroRail_C_NicknameToggle_Params
{
	bool                                               On_;                                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function IntroRail.IntroRail_C.NicknameRotate
struct AIntroRail_C_NicknameRotate_Params
{
};

// Function IntroRail.IntroRail_C.End
struct AIntroRail_C_End_Params
{
};

// Function IntroRail.IntroRail_C.ChangeFOV
struct AIntroRail_C_ChangeFOV_Params
{
	bool                                               On_;                                                       // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function IntroRail.IntroRail_C.ReceiveTick
struct AIntroRail_C_ReceiveTick_Params
{
	float                                              DeltaSeconds;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function IntroRail.IntroRail_C.ReceiveBeginPlay
struct AIntroRail_C_ReceiveBeginPlay_Params
{
};

// Function IntroRail.IntroRail_C.ChangeValueFOV
struct AIntroRail_C_ChangeValueFOV_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function IntroRail.IntroRail_C.ExecuteUbergraph_IntroRail
struct AIntroRail_C_ExecuteUbergraph_IntroRail_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
