#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct KillerSpells.KillerSpells
// 0x0078
struct FKillerSpells
{
	struct FString                                     Skill1Name_2_0711D3A74DEFB3E8EBB7089711425CAE;             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FString                                     Skill1Desc_4_342517AA47A58CBBFE0B87B206CB2701;             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UPaperSprite*                                Skill1Image_22_DDEB43544C918A61A78D8387D5540324;           // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FString                                     Skill2Name_15_0FA11F4F454FD02B7095F3B29A693476;            // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FString                                     Skill2Desc_17_0E612EB64F3997818EF5B8A445091D2F;            // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UPaperSprite*                                Skill2Image_23_0689F979485AD7F7E2C6739E5E31CFEA;           // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FString                                     Skill3Name_20_BB50444240C779BFD79A209041E3573B;            // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FString                                     Skill3Desc_21_B11CD1494FA368082A5825BAD9B7E5D8;            // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UPaperSprite*                                Skill3Image_24_1613C25B444DF73298666AA960C0C301;           // 0x0070(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
