#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function KillerMasterBP.KillerMasterBP_C.HeadRotationFunc
struct AKillerMasterBP_C_HeadRotationFunc_Params
{
	struct FRotator                                    Rotation;                                                  // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.AddWiggleParasiteMovement
struct AKillerMasterBP_C_AddWiggleParasiteMovement_Params
{
	float                                              WigglePower;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.get level name
struct AKillerMasterBP_C_get_level_name_Params
{
	bool                                               B;                                                         // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FString                                     Name;                                                      // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.SurfaceSoundPlayer
struct AKillerMasterBP_C_SurfaceSoundPlayer_Params
{
	class UFMODEvent*                                  Event;                                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.ChairCheckFunc
struct AKillerMasterBP_C_ChairCheckFunc_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.ScreenshotFunc
struct AKillerMasterBP_C_ScreenshotFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.MoveSoundFunc
struct AKillerMasterBP_C_MoveSoundFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.AlarmBrokeTimer
struct AKillerMasterBP_C_AlarmBrokeTimer_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.coinDropper
struct AKillerMasterBP_C_coinDropper_Params
{
	bool                                               Flashlight;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ASurvivorMasterBP_C*                         Surv;                                                      // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               local_;                                                    // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.NewFunction_2
struct AKillerMasterBP_C_NewFunction_2_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.SeeOtherKillers
struct AKillerMasterBP_C_SeeOtherKillers_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.PickupSpeed
struct AKillerMasterBP_C_PickupSpeed_Params
{
	bool                                               pickup;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                              B;                                                         // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.Hypno Chair Ref Killer
struct AKillerMasterBP_C_Hypno_Chair_Ref_Killer_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.SurvSeeAddTimer
struct AKillerMasterBP_C_SurvSeeAddTimer_Params
{
	class ASurvivorMasterBP_C*                         SurvRef;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              timeAdd;                                                   // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Close_;                                                    // 0x000C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.SurvSeeTimer
struct AKillerMasterBP_C_SurvSeeTimer_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Melee Keymaster?
struct AKillerMasterBP_C_Melee_Keymaster__Params
{
	bool                                               B;                                                         // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.BloodLust
struct AKillerMasterBP_C_BloodLust_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ChaseOffGameEnd
struct AKillerMasterBP_C_ChaseOffGameEnd_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Game Mode
struct AKillerMasterBP_C_Game_Mode_Params
{
	bool                                               Propnight_;                                                // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.OnRep_Stunned?
struct AKillerMasterBP_C_OnRep_Stunned__Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.DynamicMatInit
struct AKillerMasterBP_C_DynamicMatInit_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.SurvChaser
struct AKillerMasterBP_C_SurvChaser_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.OnRep_HandAttack
struct AKillerMasterBP_C_OnRep_HandAttack_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ElevatorTrace
struct AKillerMasterBP_C_ElevatorTrace_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Surf Track 3000
struct AKillerMasterBP_C_Surf_Track_3000_Params
{
	float                                              TimeIn;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.surv to chair
struct AKillerMasterBP_C_surv_to_chair_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.GetSurvCrawlInBox
struct AKillerMasterBP_C_GetSurvCrawlInBox_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.NewFunction_1
struct AKillerMasterBP_C_NewFunction_1_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.LocationChangerKiller
struct AKillerMasterBP_C_LocationChangerKiller_Params
{
	class AActor*                                      NewParam;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.LocationCheckForSurv
struct AKillerMasterBP_C_LocationCheckForSurv_Params
{
	bool                                               Hit_;                                                      // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.SurvHpCalc
struct AKillerMasterBP_C_SurvHpCalc_Params
{
	class ASurvivorMasterBP_C*                         SurvRefIn;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                DamageIn;                                                  // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Bool;                                                      // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.SurfaceSound
struct AKillerMasterBP_C_SurfaceSound_Params
{
	TEnumAsByte<PhysicsCore_EPhysicalSurface>          InputPin;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.SpeedDown
struct AKillerMasterBP_C_SpeedDown_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.SpeedUp
struct AKillerMasterBP_C_SpeedUp_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.reduceMaxWalkSpeed
struct AKillerMasterBP_C_reduceMaxWalkSpeed_Params
{
	float                                              MaxSpeedPercent;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.MouseClickStopwatch
struct AKillerMasterBP_C_MouseClickStopwatch_Params
{
	float                                              A;                                                         // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               SuperSmash_;                                               // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.impulse forward
struct AKillerMasterBP_C_impulse_forward_Params
{
	class UCharacterMovementComponent*                 self2;                                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*                 self3;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.Forward
struct AKillerMasterBP_C_Forward_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_0__FinishedFunc
struct AKillerMasterBP_C_Timeline_0__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_0__UpdateFunc
struct AKillerMasterBP_C_Timeline_0__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.IncreasorSpeed__FinishedFunc
struct AKillerMasterBP_C_IncreasorSpeed__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.IncreasorSpeed__UpdateFunc
struct AKillerMasterBP_C_IncreasorSpeed__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.DecreasorSpeed__FinishedFunc
struct AKillerMasterBP_C_DecreasorSpeed__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.DecreasorSpeed__UpdateFunc
struct AKillerMasterBP_C_DecreasorSpeed__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.SoundTimeline__FinishedFunc
struct AKillerMasterBP_C_SoundTimeline__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.SoundTimeline__UpdateFunc
struct AKillerMasterBP_C_SoundTimeline__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.StopSoundChaseTimeline__FinishedFunc
struct AKillerMasterBP_C_StopSoundChaseTimeline__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.StopSoundChaseTimeline__UpdateFunc
struct AKillerMasterBP_C_StopSoundChaseTimeline__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_1__FinishedFunc
struct AKillerMasterBP_C_Timeline_1__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_1__UpdateFunc
struct AKillerMasterBP_C_Timeline_1__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_2__FinishedFunc
struct AKillerMasterBP_C_Timeline_2__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_2__UpdateFunc
struct AKillerMasterBP_C_Timeline_2__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_3__FinishedFunc
struct AKillerMasterBP_C_Timeline_3__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_3__UpdateFunc
struct AKillerMasterBP_C_Timeline_3__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_4__FinishedFunc
struct AKillerMasterBP_C_Timeline_4__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_4__UpdateFunc
struct AKillerMasterBP_C_Timeline_4__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ScaleSizer__FinishedFunc
struct AKillerMasterBP_C_ScaleSizer__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ScaleSizer__UpdateFunc
struct AKillerMasterBP_C_ScaleSizer__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.AfterStunColor__FinishedFunc
struct AKillerMasterBP_C_AfterStunColor__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.AfterStunColor__UpdateFunc
struct AKillerMasterBP_C_AfterStunColor__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_5__FinishedFunc
struct AKillerMasterBP_C_Timeline_5__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_5__UpdateFunc
struct AKillerMasterBP_C_Timeline_5__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_6__FinishedFunc
struct AKillerMasterBP_C_Timeline_6__FinishedFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Timeline_6__UpdateFunc
struct AKillerMasterBP_C_Timeline_6__UpdateFunc_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.InpTchEvt_Released
struct AKillerMasterBP_C_InpTchEvt_Released_Params
{
	TEnumAsByte<InputCore_ETouchIndex>                 FingerIndex;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Location;                                                  // 0x0004(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpTchEvt_Pressed
struct AKillerMasterBP_C_InpTchEvt_Pressed_Params
{
	TEnumAsByte<InputCore_ETouchIndex>                 FingerIndex;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Location;                                                  // 0x0004(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_Jump_K2Node_InputActionEvent_5
struct AKillerMasterBP_C_InpActEvt_Jump_K2Node_InputActionEvent_5_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_Jump_K2Node_InputActionEvent_4
struct AKillerMasterBP_C_InpActEvt_Jump_K2Node_InputActionEvent_4_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_Add_K2Node_InputKeyEvent_14
struct AKillerMasterBP_C_InpActEvt_Add_K2Node_InputKeyEvent_14_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_Subtract_K2Node_InputKeyEvent_13
struct AKillerMasterBP_C_InpActEvt_Subtract_K2Node_InputKeyEvent_13_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_F3_K2Node_InputKeyEvent_12
struct AKillerMasterBP_C_InpActEvt_F3_K2Node_InputKeyEvent_12_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_NumPadOne_K2Node_InputKeyEvent_11
struct AKillerMasterBP_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_11_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_NumPadTwo_K2Node_InputKeyEvent_10
struct AKillerMasterBP_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_10_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_F2_K2Node_InputKeyEvent_9
struct AKillerMasterBP_C_InpActEvt_F2_K2Node_InputKeyEvent_9_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_NumPadThree_K2Node_InputKeyEvent_8
struct AKillerMasterBP_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_8_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_NumPadZero_K2Node_InputKeyEvent_7
struct AKillerMasterBP_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_7_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_Multiply_K2Node_InputKeyEvent_6
struct AKillerMasterBP_C_InpActEvt_Multiply_K2Node_InputKeyEvent_6_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C. Pick Up Survivor_K2Node_InputActionEvent_3
struct AKillerMasterBP_C__Pick_Up_Survivor_K2Node_InputActionEvent_3_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C. Pick Up Survivor_K2Node_InputActionEvent_2
struct AKillerMasterBP_C__Pick_Up_Survivor_K2Node_InputActionEvent_2_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_Attack_K2Node_InputActionEvent_1
struct AKillerMasterBP_C_InpActEvt_Attack_K2Node_InputActionEvent_1_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_J_K2Node_InputKeyEvent_5
struct AKillerMasterBP_C_InpActEvt_J_K2Node_InputKeyEvent_5_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_Divide_K2Node_InputKeyEvent_4
struct AKillerMasterBP_C_InpActEvt_Divide_K2Node_InputKeyEvent_4_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_Add_K2Node_InputKeyEvent_3
struct AKillerMasterBP_C_InpActEvt_Add_K2Node_InputKeyEvent_3_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_NumPadZero_K2Node_InputKeyEvent_2
struct AKillerMasterBP_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_2_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpActEvt_One_K2Node_InputKeyEvent_1
struct AKillerMasterBP_C_InpActEvt_One_K2Node_InputKeyEvent_1_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.CustopDepth
struct AKillerMasterBP_C_CustopDepth_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.AlarmSee
struct AKillerMasterBP_C_AlarmSee_Params
{
	class AActor*                                      NewParam;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.pickup
struct AKillerMasterBP_C_pickup_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ChairOverlapEventServ
struct AKillerMasterBP_C_ChairOverlapEventServ_Params
{
	class AHypnoChairBP_C*                             ChairRef;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.ChairOverlapEventMulti
struct AKillerMasterBP_C_ChairOverlapEventMulti_Params
{
	class AHypnoChairBP_C*                             ChairRef;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.TeleportServer
struct AKillerMasterBP_C_TeleportServer_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.TeleportMulti
struct AKillerMasterBP_C_TeleportMulti_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.InpAxisEvt_Turn_K2Node_InputAxisEvent_48
struct AKillerMasterBP_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_48_Params
{
	float                                              AxisValue;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.SurvSpyEyeOn
struct AKillerMasterBP_C_SurvSpyEyeOn_Params
{
	class ASurvivorMasterBP_C*                         SurvRef;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASpyEye_C*                                   SpyEye;                                                    // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.SurvSpyEyeOff
struct AKillerMasterBP_C_SurvSpyEyeOff_Params
{
	class ASpyEye_C*                                   SpyEye;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivorMasterBP_C*                         SurvRef;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpAxisEvt_LookUp_K2Node_InputAxisEvent_41
struct AKillerMasterBP_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_41_Params
{
	float                                              AxisValue;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.Hitter
struct AKillerMasterBP_C_Hitter_Params
{
	class ASurvivorMasterBP_C*                         SurvRef;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Damage;                                                    // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               knife;                                                     // 0x000C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Range;                                                     // 0x000D(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               BackStab;                                                  // 0x000E(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               VampireBite;                                               // 0x000F(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.DecreaseWalkSpeed
struct AKillerMasterBP_C_DecreaseWalkSpeed_Params
{
	bool                                               Hited_;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Range_;                                                    // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.DecreaseWalkSpeedMulti
struct AKillerMasterBP_C_DecreaseWalkSpeedMulti_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.IncreaseWalkSpeed
struct AKillerMasterBP_C_IncreaseWalkSpeed_Params
{
	bool                                               Hited;                                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Range_;                                                    // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.IncreaseWalkSpeedMulti
struct AKillerMasterBP_C_IncreaseWalkSpeedMulti_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.AmmoSet
struct AKillerMasterBP_C_AmmoSet_Params
{
	int                                                Ammo;                                                      // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.AmmoRotation
struct AKillerMasterBP_C_AmmoRotation_Params
{
	struct FRotator                                    Rotator;                                                   // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.RotationAtack
struct AKillerMasterBP_C_RotationAtack_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.LocalRotationEvent
struct AKillerMasterBP_C_LocalRotationEvent_Params
{
	struct FRotator                                    NewParam;                                                  // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.SpeedChangeServ
struct AKillerMasterBP_C_SpeedChangeServ_Params
{
	float                                              NewParam;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.cdAtack
struct AKillerMasterBP_C_cdAtack_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ChairOverlapEndServ
struct AKillerMasterBP_C_ChairOverlapEndServ_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ChairOvelapEndMulti
struct AKillerMasterBP_C_ChairOvelapEndMulti_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
struct AKillerMasterBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature_Params
{
	class UPrimitiveComponent*                         OverlappedComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      OtherActor;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                OtherBodyIndex;                                            // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               bFromSweep;                                                // 0x001C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                                  SweepResult;                                               // 0x0020(0x008C)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// Function KillerMasterBP.KillerMasterBP_C.BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
struct AKillerMasterBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature_Params
{
	class UPrimitiveComponent*                         OverlappedComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      OtherActor;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                OtherBodyIndex;                                            // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.ExplosionSoundServ
struct AKillerMasterBP_C_ExplosionSoundServ_Params
{
	class UStaticMeshComponent*                        bullet;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.FlashLightIncreaseSpeed
struct AKillerMasterBP_C_FlashLightIncreaseSpeed_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ChairChek
struct AKillerMasterBP_C_ChairChek_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ThirdPersonCamEvent
struct AKillerMasterBP_C_ThirdPersonCamEvent_Params
{
	bool                                               Now_;                                                      // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               NoDelay_;                                                  // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.FirstPersonCamEvent
struct AKillerMasterBP_C_FirstPersonCamEvent_Params
{
	bool                                               Now_;                                                      // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               NoDelay_;                                                  // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.RotationCameraServ
struct AKillerMasterBP_C_RotationCameraServ_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.RotationCameraMulti
struct AKillerMasterBP_C_RotationCameraMulti_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.AstralSoundIn
struct AKillerMasterBP_C_AstralSoundIn_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.AstralSoundOut
struct AKillerMasterBP_C_AstralSoundOut_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.AstralSoundInvisibility
struct AKillerMasterBP_C_AstralSoundInvisibility_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.SoundAmbStart
struct AKillerMasterBP_C_SoundAmbStart_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.AtackAudio
struct AKillerMasterBP_C_AtackAudio_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.SpeedChangeMulti
struct AKillerMasterBP_C_SpeedChangeMulti_Params
{
	float                                              NewParam;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.SphereDrawServ
struct AKillerMasterBP_C_SphereDrawServ_Params
{
	struct FVector                                     NewParam;                                                  // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.SphereDrawMulti
struct AKillerMasterBP_C_SphereDrawMulti_Params
{
	struct FVector                                     NewParam;                                                  // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.AtackAnimServ
struct AKillerMasterBP_C_AtackAnimServ_Params
{
	bool                                               NewParam;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.AtackAnimMulti
struct AKillerMasterBP_C_AtackAnimMulti_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.MeshVisibiltyOff
struct AKillerMasterBP_C_MeshVisibiltyOff_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.MulticastChangeFootwear
struct AKillerMasterBP_C_MulticastChangeFootwear_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.DeleyerAttackCollision
struct AKillerMasterBP_C_DeleyerAttackCollision_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.MeshVisibilityOn
struct AKillerMasterBP_C_MeshVisibilityOn_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.AmbientOff
struct AKillerMasterBP_C_AmbientOff_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.LaughServ
struct AKillerMasterBP_C_LaughServ_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.LaughMulti
struct AKillerMasterBP_C_LaughMulti_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ServerChangeFootwear
struct AKillerMasterBP_C_ServerChangeFootwear_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.SetCharacterOwner
struct AKillerMasterBP_C_SetCharacterOwner_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ChangeFootState
struct AKillerMasterBP_C_ChangeFootState_Params
{
	TEnumAsByte<EFootState_EFootState>                 New_Style;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.XLocationMeshEv
struct AKillerMasterBP_C_XLocationMeshEv_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.JumpChek
struct AKillerMasterBP_C_JumpChek_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.BeginFootprint
struct AKillerMasterBP_C_BeginFootprint_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.SpawnDecal
struct AKillerMasterBP_C_SpawnDecal_Params
{
	struct FName                                       SocketName;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Right;                                                     // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Left;                                                      // 0x0009(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               JumpStart;                                                 // 0x000A(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               JumpEnd;                                                   // 0x000B(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Killer_;                                                   // 0x000C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               ImProp_;                                                   // 0x000D(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Run_;                                                      // 0x000E(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Crouch_;                                                   // 0x000F(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFMODAudioComponent*                         FMODAudio;                                                 // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                KillerType;                                                // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Crawl_;                                                    // 0x001C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Shake;                                                     // 0x001D(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.Chair Open Stage
struct AKillerMasterBP_C_Chair_Open_Stage_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.HitterServ
struct AKillerMasterBP_C_HitterServ_Params
{
	class ASurvivorMasterBP_C*                         SurvRef;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Damage;                                                    // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Crawl;                                                     // 0x000C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Knife_;                                                    // 0x000D(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Range;                                                     // 0x000E(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               BackStab;                                                  // 0x000F(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               VampireBite_;                                              // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.StartAnimShot
struct AKillerMasterBP_C_StartAnimShot_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.PlantAnim
struct AKillerMasterBP_C_PlantAnim_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.PlantAnimServ
struct AKillerMasterBP_C_PlantAnimServ_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.PlantAnimMulti
struct AKillerMasterBP_C_PlantAnimMulti_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.HitterMulti
struct AKillerMasterBP_C_HitterMulti_Params
{
	class ASurvivorMasterBP_C*                         SurvRef;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Crawl;                                                     // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Chair;                                                     // 0x0009(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.ShootAudio
struct AKillerMasterBP_C_ShootAudio_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.ActivateSurv
struct AKillerMasterBP_C_ActivateSurv_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.hitSuface
struct AKillerMasterBP_C_hitSuface_Params
{
	bool                                               Range_;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                        Mesh;                                                      // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Loc;                                                       // 0x0010(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     norm;                                                      // 0x001C(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                                  HitResult;                                                 // 0x0028(0x008C)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// Function KillerMasterBP.KillerMasterBP_C.ChairServ
struct AKillerMasterBP_C_ChairServ_Params
{
	class AHypnoChairBP_C*                             Chair;                                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.ChairMulti
struct AKillerMasterBP_C_ChairMulti_Params
{
	class AHypnoChairBP_C*                             Chair;                                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.SurvPropSound
struct AKillerMasterBP_C_SurvPropSound_Params
{
	TEnumAsByte<PhysicsCore_EPhysicalSurface>          SurfaceType;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.SurfaceServ
struct AKillerMasterBP_C_SurfaceServ_Params
{
	TEnumAsByte<PhysicsCore_EPhysicalSurface>          Surface;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                        Mesh;                                                      // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Range;                                                     // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.SurfaceMulti
struct AKillerMasterBP_C_SurfaceMulti_Params
{
	TEnumAsByte<PhysicsCore_EPhysicalSurface>          Surface;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                        Mesh;                                                      // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Range;                                                     // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.SurvImpactSound
struct AKillerMasterBP_C_SurvImpactSound_Params
{
	class ASurvivorMasterBP_C*                         Surv;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               knife;                                                     // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Range;                                                     // 0x0009(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               BackStab;                                                  // 0x000A(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function KillerMasterBP.KillerMasterBP_C.SurvImpactSoundServ
struct AKillerMasterBP_C_SurvImpactSoundServ_Params
{
	class ASurvivorMasterBP_C*                         Surv;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TEnumAsByte<DamageTypeEnum_EDamageTypeEnum>        damagType;                                                 // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.SurvImpactSoundMulti
struct AKillerMasterBP_C_SurvImpactSoundMulti_Params
{
	class ASurvivorMasterBP_C*                         Surv;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TEnumAsByte<DamageTypeEnum_EDamageTypeEnum>        DmgType;                                                   // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.ChairEvent
struct AKillerMasterBP_C_ChairEvent_Params
{
	class AHypnoChairBP_C*                             Chair;                                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.LookUpServ
struct AKillerMasterBP_C_LookUpServ_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.LookUpMulti
struct AKillerMasterBP_C_LookUpMulti_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.TurnServ
struct AKillerMasterBP_C_TurnServ_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.TurnMulti
struct AKillerMasterBP_C_TurnMulti_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.SetKillerType
struct AKillerMasterBP_C_SetKillerType_Params
{
	int                                                Type;                                                      // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.CDATACKER
struct AKillerMasterBP_C_CDATACKER_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.KillKnifeServ
struct AKillerMasterBP_C_KillKnifeServ_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.KillKnifeMulti
struct AKillerMasterBP_C_KillKnifeMulti_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.KnifeShootSoundStart
struct AKillerMasterBP_C_KnifeShootSoundStart_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.KnifeSpawnSound
struct AKillerMasterBP_C_KnifeSpawnSound_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.WeaponImpact
struct AKillerMasterBP_C_WeaponImpact_Params
{
	class UStaticMeshComponent*                        meshRef;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.KnifeDetectorSoundTrue
struct AKillerMasterBP_C_KnifeDetectorSoundTrue_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.KnifeDetectorSoundFalse
struct AKillerMasterBP_C_KnifeDetectorSoundFalse_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.HUDON
struct AKillerMasterBP_C_HUDON_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.Drop
struct AKillerMasterBP_C_Drop_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.InertCamera
struct AKillerMasterBP_C_InertCamera_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.HotkeyStarter
struct AKillerMasterBP_C_HotkeyStarter_Params
{
	class ASurvivorMasterBP_C*                         SurvRef;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.JumpFall
struct AKillerMasterBP_C_JumpFall_Params
{
};

// Function KillerMasterBP.KillerMasterBP_C.InpAxisEvt_TurnRate_K2Node_InputAxisEvent_39
struct AKillerMasterBP_C_InpAxisEvt_TurnRate_K2Node_InputAxisEvent_39_Params
{
	float                                              AxisValue;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.InpAxisEvt_LookUpRate_K2Node_InputAxisEvent_54
struct AKillerMasterBP_C_InpAxisEvt_LookUpRate_K2Node_InputAxisEvent_54_Params
{
	float                                              AxisValue;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.IncreaseSpeedMulti
struct AKillerMasterBP_C_IncreaseSpeedMulti_Params
{
	float                                              CurrentSpeed;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              NewSpeed;                                                  // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              MultiplyTime;                                              // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.IncreaseSpeedServ
struct AKillerMasterBP_C_IncreaseSpeedServ_Params
{
	float                                              CurrentSpeed;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              NewSpeed;                                                  // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              MultiplyTime;                                              // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function KillerMasterBP.KillerMasterBP_C.DecreaseSpeedServ
struct AKillerMasterBP_C_DecreaseSpeedServ_Params
{
	float                                              CurrentSpeed;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
