#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C
// 0x30AF (FullSize[0x3367] - InheritedSize[0x02B8])
class UMainchar1_AnimBP_FPP_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_QOG6[0x8];                                     // 0x02B8(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x02C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7;                           // 0x02C8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_45;                           // 0x0368(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16;                         // 0x03E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15;                         // 0x0410(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14;                         // 0x0438(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13;                         // 0x0460(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12;                         // 0x0488(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11;                         // 0x04B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10;                         // 0x04D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9;                          // 0x0500(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8;                          // 0x0528(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7;                          // 0x0550(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6;                          // 0x0578(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5;                          // 0x05A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4;                          // 0x05C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3;                          // 0x05F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2;                          // 0x0618(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                            // 0x0640(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_44;                           // 0x0668(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_43;                           // 0x06E8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_42;                           // 0x0768(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41;                           // 0x07E8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_40;                           // 0x0868(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_39;                           // 0x08E8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_38;                           // 0x0968(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_37;                           // 0x09E8(0x0080)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_5;                           // 0x0A68(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9;                               // 0x0B18(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_36;                           // 0x0B48(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8;                               // 0x0BC8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_35;                           // 0x0BF8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7;                               // 0x0C78(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_34;                           // 0x0CA8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6;                               // 0x0D28(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9;                          // 0x0D58(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8;                          // 0x0E40(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7;                          // 0x0F28(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6;                          // 0x1010(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5;                          // 0x10F8(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4;                          // 0x11E0(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3;                          // 0x12C8(0x00E8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_4;                           // 0x13B0(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2;                          // 0x1460(0x00E8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5;                               // 0x1548(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer;                            // 0x1578(0x00E8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4;                               // 0x1660(0x0030)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_3;                            // 0x1690(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_33;                           // 0x1730(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_32;                           // 0x17B0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_31;                           // 0x1830(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_30;                           // 0x18B0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_29;                           // 0x1930(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_28;                           // 0x19B0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_27;                           // 0x1A30(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_26;                           // 0x1AB0(0x0080)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3;                           // 0x1B30(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_25;                           // 0x1BE0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3;                               // 0x1C60(0x0030)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_2;                            // 0x1C90(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_24;                           // 0x1D30(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23;                           // 0x1DB0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_22;                           // 0x1E30(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_21;                           // 0x1EB0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20;                           // 0x1F30(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19;                           // 0x1FB0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18;                           // 0x2030(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17;                           // 0x20B0(0x0080)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_2;                           // 0x2130(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_16;                           // 0x21E0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2;                               // 0x2260(0x0030)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt;                              // 0x2290(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15;                           // 0x2330(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14;                           // 0x23B0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13;                           // 0x2430(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_12;                           // 0x24B0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11;                           // 0x2530(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10;                           // 0x25B0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9;                            // 0x2630(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8;                            // 0x26B0(0x0080)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum;                             // 0x2730(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7;                            // 0x27E0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                 // 0x2860(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                                // 0x2890(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                        // 0x2940(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6;                            // 0x2970(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6;                           // 0x29F0(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2;                            // 0x2A90(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose;                              // 0x2BE8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2;                             // 0x2D40(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose;                               // 0x2D68(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5;                            // 0x2D90(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4;                            // 0x2E10(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5;                           // 0x2E90(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3;                            // 0x2F30(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4;                           // 0x2FB0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3;                           // 0x3050(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2;                            // 0x30F0(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2;                           // 0x3170(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                              // 0x3210(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool;                             // 0x3290(0x00A0)
	bool                                               Isowner_;                                                  // 0x3330(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsInAir_;                                                  // 0x3331(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_BLNG[0x2];                                     // 0x3332(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Speed;                                                     // 0x3334(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Direction;                                                 // 0x3338(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Crawl_;                                                    // 0x333C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               FPP_;                                                      // 0x333D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               OnChair_;                                                  // 0x333E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Grapple_;                                                  // 0x333F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               EndJump_;                                                  // 0x3340(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_31H8[0x3];                                     // 0x3341(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              HasItem;                                                   // 0x3344(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TEnumAsByte<ItemType_EItemType>                    ItemType;                                                  // 0x3348(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               UseFlashlight_;                                            // 0x3349(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TEnumAsByte<SurvStateEnum_ESurvStateEnum>          SurvStateEnum;                                             // 0x334A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TEnumAsByte<MovementTypeEnum_EMovementTypeEnum>    MovementType;                                              // 0x334B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               ItemTake_;                                                 // 0x334C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               ItemSwap_;                                                 // 0x334D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_AOMA[0x2];                                     // 0x334E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     NewVar_1;                                                  // 0x3350(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              XYSpeed;                                                   // 0x335C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TEnumAsByte<SurvChars_ESurvChars>                  Surv_Char;                                                 // 0x3360(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Energy_Drnk_Anim_B;                                        // 0x3361(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               KBook_Anim_B;                                              // 0x3362(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Painkiller;                                                // 0x3363(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               ThrowGrenade;                                              // 0x3364(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               TakeRune;                                                  // 0x3365(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Is_Tool_Activated;                                         // 0x3366(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_C77FC88B44B6DD122AD850872D4B54B5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_55FBB1ED45B02668EB5D5DB9BE61A5C8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendListByInt_39A4AC9743382A30848694BCA1D96857();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendListByInt_A5A4770F48D2FEFF31400B949B889F37();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendListByInt_23B75C524450D0FDD4D8E98A08DF68AA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendSpacePlayer_162DEEE04C9561A167642FBBB47B2B38();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_0CCACD864C81FAC79D919B81336CD1F2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_CB529EE44EECBAF57C5696A1C2616DFF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_BBCF7EB7476B82C0A263CEB58767E1A9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_F5ECCD214B7B4BD6E6B77284AD666A48();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_F102EF4848D2CD5AE0A87B8427F5CC4C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_14B563194CD9C43BDF13449F03A7828D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_F6FBF8E04F1D571717C2DD9F60AE9F4E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_5E1A8CEF48353FE0749D60AE7FED512E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_BE4683AC4725A74ACBC872BA8A9AD86B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_79B2853947291BB2C2EB78952A95D057();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_25C21A2E4DA6B0E71CDFD7A7F37E804E();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_L_Footprint();
	void AnimNotify_R_Footprint();
	void AnimNotify_JumpEnd();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_B8CE64394967BDDF50F7168B9EAF873B();
	void SendState(TEnumAsByte<SurvStateEnum_ESurvStateEnum> SurvState, TEnumAsByte<MovementTypeEnum_EMovementTypeEnum> MovementType);
	void ExecuteUbergraph_Mainchar1_AnimBP_FPP(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
