#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass NewKeyMasterAnimBP.NewKeyMasterAnimBP_C
// 0x2B08 (FullSize[0x2DC0] - InheritedSize[0x02B8])
class UNewKeyMasterAnimBP_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_EFGL[0x8];                                     // 0x02B8(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x02C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48;                         // 0x02C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47;                         // 0x02F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46;                         // 0x0318(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_45;                         // 0x0340(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44;                         // 0x0368(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43;                         // 0x0390(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42;                         // 0x03B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41;                         // 0x03E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40;                         // 0x0408(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_39;                         // 0x0430(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_38;                         // 0x0458(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37;                         // 0x0480(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_36;                         // 0x04A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35;                         // 0x04D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_34;                         // 0x04F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33;                         // 0x0520(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32;                         // 0x0548(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_31;                         // 0x0570(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30;                         // 0x0598(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_29;                         // 0x05C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_28;                         // 0x05E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27;                         // 0x0610(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_26;                         // 0x0638(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_25;                         // 0x0660(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_24;                         // 0x0688(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23;                         // 0x06B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22;                         // 0x06D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21;                         // 0x0700(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_20;                         // 0x0728(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19;                         // 0x0750(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_18;                         // 0x0778(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17;                         // 0x07A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16;                         // 0x07C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15;                         // 0x07F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14;                         // 0x0818(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13;                         // 0x0840(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12;                         // 0x0868(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11;                         // 0x0890(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10;                         // 0x08B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9;                          // 0x08E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8;                          // 0x0908(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7;                          // 0x0930(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6;                          // 0x0958(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5;                          // 0x0980(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4;                          // 0x09A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3;                          // 0x09D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2;                          // 0x09F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                            // 0x0A20(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_11;                         // 0x0A48(0x00E8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8;                          // 0x0B30(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19;                           // 0x0BF0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_14;                              // 0x0C70(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_10;                         // 0x0CA0(0x00E8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7;                          // 0x0D88(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18;                           // 0x0E48(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_13;                              // 0x0EC8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17;                           // 0x0EF8(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3;                           // 0x0F78(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_16;                           // 0x1018(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_12;                              // 0x1098(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15;                           // 0x10C8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_11;                              // 0x1148(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14;                           // 0x1178(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_10;                              // 0x11F8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13;                           // 0x1228(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9;                               // 0x12A8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_12;                           // 0x12D8(0x0080)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9;                          // 0x1358(0x00E8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6;                          // 0x1440(0x00C0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8;                               // 0x1500(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11;                           // 0x1530(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7;                               // 0x15B0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10;                           // 0x15E0(0x0080)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8;                          // 0x1660(0x00E8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5;                          // 0x1748(0x00C0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6;                               // 0x1808(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7;                          // 0x1838(0x00E8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4;                          // 0x1920(0x00C0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6;                          // 0x19E0(0x00E8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5;                               // 0x1AC8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9;                            // 0x1AF8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8;                            // 0x1B78(0x0080)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_5;                               // 0x1BF8(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4;                               // 0x1CC0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7;                            // 0x1CF0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6;                            // 0x1D70(0x0080)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_4;                               // 0x1DF0(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3;                               // 0x1EB8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5;                            // 0x1EE8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4;                            // 0x1F68(0x0080)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_3;                               // 0x1FE8(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2;                               // 0x20B0(0x0030)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3;                          // 0x20E0(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2;                          // 0x21A0(0x00C0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5;                          // 0x2260(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4;                          // 0x2348(0x00E8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_2;                               // 0x2430(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3;                            // 0x24F8(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2;                            // 0x2578(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2;                           // 0x25F8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool;                             // 0x2698(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3;                          // 0x2738(0x00E8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                              // 0x2820(0x0080)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend;                            // 0x28A0(0x00C0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2;                          // 0x2960(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer;                            // 0x2A48(0x00E8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend;                                 // 0x2B30(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                 // 0x2BF8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                                // 0x2C28(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                        // 0x2CD8(0x0030)
	bool                                               IsOnAir_;                                                  // 0x2D08(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Attak;                                                     // 0x2D09(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Isowner_;                                                  // 0x2D0A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_ZJ5H[0x1];                                     // 0x2D0B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Speed;                                                     // 0x2D0C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Direction;                                                 // 0x2D10(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              IsHolded;                                                  // 0x2D14(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               JumpEndChek;                                               // 0x2D18(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               FIRE;                                                      // 0x2D19(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Plant;                                                     // 0x2D1A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Flashed;                                                   // 0x2D1B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              Vertical_rotation;                                         // 0x2D1C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              HorizontalValue;                                           // 0x2D20(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              SpeedChek;                                                 // 0x2D24(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                KillerType;                                                // 0x2D28(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Drop;                                                      // 0x2D2C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               ChairDrop;                                                 // 0x2D2D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Catch;                                                     // 0x2D2E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Runaway;                                                   // 0x2D2F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    HeadR;                                                     // 0x2D30(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bTurnL;                                                    // 0x2D3C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bTurnR;                                                    // 0x2D3D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_KTAD[0x2];                                     // 0x2D3E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class AKeymaster_C*                                KillerRef;                                                 // 0x2D40(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                TypeAttack;                                                // 0x2D48(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               MarioStun;                                                 // 0x2D4C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               PropHunt_;                                                 // 0x2D4D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               Get_Ready;                                                 // 0x2D4E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_8SIZ[0x1];                                     // 0x2D4F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTransform                                  Effector_Transform;                                        // 0x2D50(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              SpeedRateF;                                                // 0x2D80(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	unsigned char                                      UnknownData_NKL1[0xC];                                     // 0x2D84(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTransform                                  HammerLocation;                                            // 0x2D90(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass NewKeyMasterAnimBP.NewKeyMasterAnimBP_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void SpeedRate();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_57A26A5B4946D8A03D2C0F840C7DEA70();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_C3D546D742BDED6BEAA828944161904E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TwoWayBlend_429E6D7846417E819C7EA29D1F263E7F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_BlendListByBool_4AB8EF9C41D16A43F182CF8C0A38BF78();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_C725D64D469DDE8DD4F42EA9B28621D5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_B4EB2206480870D24E38C2AA3E7DB05B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_0D17BCA041CACC9C7023F1909D7B7520();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_3107136D4F07EB73C41F1EBACEAD3DB4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_D788258B493BFF66B2B0538202967D3E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_2059E55B46DFC2B7407FFDBA81194906();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_11B4A61B407E9E781D03498542935381();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_70116D5D402F5AF45CA3A28CFC7F29DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_8388AAE34E930358E337DF8D408D60E8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_A98BE482471F67C09EC7C9AFE1FDCBA2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_6C41F6D9467333BC2EC0CAAA9C8A93CF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_CF47EFDA4E0ED226B34666B0B0E74458();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_99411A09491234F3F84655818FB4EF2E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_C1E4EEC9490FD1204F4AE482C3CBAD98();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_988B1FE34E1F2C8AD7EE97BDB0062C54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_4B259DE64202036D03E4A0A1482FCF08();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_AD6F22034E0163D148ED5CBDBD408FE4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_A353AC91420CD0BB85FD47A6AFE31B91();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_F14C37254B6C42BF712FB48EB3907979();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_30D00FFF48F59A32BB7F07A21B53D7AB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_09A026564B5CD83F83AAA59071CE5D39();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_2F31D0B145FBCE8EB21300AC04005884();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_9E3D5E4F4E47AFF5CB7992823B181BE0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_E597A91245B13D3CA04B94959C7D115B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_736134EB4209436A91DC198CEF207716();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_4685978945FBA34E6EC73EA3AC0B9429();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_5D71582C41B10D8AF8CCB9B38519A092();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_6C7A19BF4F81019C4C3C61A3FCAF5CF3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_6A04AB124316C1A3273C7DB847CF73C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_F1065A4E466A80A75F75F8943F512E82();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_4D6CF1CC4B64DAF1131FC6B0FFCBCB3B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_17C45517433295C1066B9A8FB4FEC6A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_A03FEFA24779D9309EE0A1941DF557FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_E0C7E88B4DE5C27272649C91C8AB867B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_829720A74C56A97C0D433DB1D19F17EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_8CA617C842800EE9768DD4A89E94B72B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_026C911A444686020B0E4BAA8182C95A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_DA3EFAC448A633478286CC8A456691C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_4787ED4B458AC1B7AC01F590A5104678();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_1013EF30434DC69708209F92EA8693EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_A6CE570A40F84C53F8138DBAD93BC4DE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_68CAECD646C74C233991E09622A90E32();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_066B7EA84D156051B890DC9E6DFFEE2D();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_RightLeg();
	void AnimNotify_JumpEnd();
	void AnimNotify_LeftLeg();
	void AnimNotify_JumpStart();
	void BlueprintBeginPlay();
	void AnimNotify_Close_Left();
	void AnimNotify_Close_right();
	void AnimNotify_Close_Leg();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NewKeyMasterAnimBP_AnimGraphNode_TransitionResult_118596EC41B83347F33020981E9296BD();
	void ExecuteUbergraph_NewKeyMasterAnimBP(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
