#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct S_KeyRefinedData.S_KeyRefinedData
// 0x0031
struct FS_KeyRefinedData
{
	struct FText                                       RefinedDisplayText_17_5D2C8F6D40A712A68D7E3892B3EC1E09;    // 0x0000(0x0018) (Edit, BlueprintVisible)
	class UPaperSprite*                                PrimaryImage_13_D425EFA54CC97E136E93E4A416FF8859;          // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               HasPrimaryImage_8_F46230B94B8F6B8AAB55D4982F49D50D;        // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_ZQBN[0x7];                                     // 0x0021(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UPaperSprite*                                SecondaryImage_14_EE0C18AA43B288844252548305D5BEF1;        // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               HasSecondaryImage_9_B08CEE814923069B4F0286A709A7CB3D;      // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
