#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function SoundSettings.SoundSettings_C.DoCustomNavigation_2
struct USoundSettings_C_DoCustomNavigation_2_Params
{
	SlateCore_EUINavigation                            Navigation;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                     ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.DoCustomNavigation_1
struct USoundSettings_C_DoCustomNavigation_1_Params
{
	SlateCore_EUINavigation                            Navigation;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                     ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.ChangeButtonColor
struct USoundSettings_C_ChangeButtonColor_Params
{
	class UImage*                                      Low;                                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                      Higth;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Condition;                                                 // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int                                                Index;                                                     // 0x0014(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Lenght;                                                    // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               B;                                                         // 0x001C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SoundSettings.SoundSettings_C.GetText_BGMUSIC
struct USoundSettings_C_GetText_BGMUSIC_Params
{
	struct FText                                       Text_Btn;                                                  // 0x0000(0x0018)  (Parm, OutParm)
};

// Function SoundSettings.SoundSettings_C.DoCustomNavigationToVOIP
struct USoundSettings_C_DoCustomNavigationToVOIP_Params
{
	SlateCore_EUINavigation                            Navigation;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                     ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.UpdateBoostMic
struct USoundSettings_C_UpdateBoostMic_Params
{
};

// Function SoundSettings.SoundSettings_C.OnMouseWheel
struct USoundSettings_C_OnMouseWheel_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                               MouseEvent;                                                // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                                 ReturnValue;                                               // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function SoundSettings.SoundSettings_C.DoCustomNavigation_ToMic
struct USoundSettings_C_DoCustomNavigation_ToMic_Params
{
	SlateCore_EUINavigation                            Navigation;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                     ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.DoCustomNavigationToVOIPBoost
struct USoundSettings_C_DoCustomNavigationToVOIPBoost_Params
{
	SlateCore_EUINavigation                            Navigation;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                     ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.LastKnowFocus
struct USoundSettings_C_LastKnowFocus_Params
{
	class UWidget*                                     Output_Get;                                                // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.ExcuteCommandsSound
struct USoundSettings_C_ExcuteCommandsSound_Params
{
};

// Function SoundSettings.SoundSettings_C.StormVolume
struct USoundSettings_C_StormVolume_Params
{
};

// Function SoundSettings.SoundSettings_C.Save
struct USoundSettings_C_Save_Params
{
};

// Function SoundSettings.SoundSettings_C.Load
struct USoundSettings_C_Load_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__GeneralS_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__GeneralS_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.BndEvt__MusicS_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__MusicS_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.BndEvt__SFXS_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__SFXS_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.OnMouseLeave
struct USoundSettings_C_OnMouseLeave_Params
{
	struct FPointerEvent                               MouseEvent;                                                // 0x0000(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function SoundSettings.SoundSettings_C.OnMouseEnter
struct USoundSettings_C_OnMouseEnter_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                               MouseEvent;                                                // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function SoundSettings.SoundSettings_C.SetToMouseFocus
struct USoundSettings_C_SetToMouseFocus_Params
{
};

// Function SoundSettings.SoundSettings_C.LostFocusMouseClick
struct USoundSettings_C_LostFocusMouseClick_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__VOIP_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__VOIP_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.Select
struct USoundSettings_C_Select_Params
{
	class UImage*                                      Image;                                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.Deselect
struct USoundSettings_C_Deselect_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__Button_GV_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__Button_GV_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__Button_MV_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__Button_MV_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__Button_SFX_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__Button_SFX_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__Button_VOIP_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__Button_VOIP_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.SelectGV
struct USoundSettings_C_SelectGV_Params
{
};

// Function SoundSettings.SoundSettings_C.SelectMV
struct USoundSettings_C_SelectMV_Params
{
};

// Function SoundSettings.SoundSettings_C.SelectSFX
struct USoundSettings_C_SelectSFX_Params
{
};

// Function SoundSettings.SoundSettings_C.SelectVOIP
struct USoundSettings_C_SelectVOIP_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__Button_Device_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__Button_Device_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.SelectDevice
struct USoundSettings_C_SelectDevice_Params
{
};

// Function SoundSettings.SoundSettings_C.ChangeSliderColor
struct USoundSettings_C_ChangeSliderColor_Params
{
	class USlider*                                     Target;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Condition;                                                 // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SoundSettings.SoundSettings_C.ChangeTextColor
struct USoundSettings_C_ChangeTextColor_Params
{
	class UWidget*                                     Overlay;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                                  Text;                                                      // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                                  Value;                                                     // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                      Image;                                                     // 0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USlider*                                     Slider;                                                    // 0x0020(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.ChangeSliderValue
struct USoundSettings_C_ChangeSliderValue_Params
{
	class USlider*                                     Slider;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Value;                                                     // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.Tick
struct USoundSettings_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_VOIP_Boost_K2Node_ComponentBoundEvent_11_OnFloatValueChangedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_VOIP_Boost_K2Node_ComponentBoundEvent_11_OnFloatValueChangedEvent__DelegateSignature_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.BndEvt__VoiceDevice_K2Node_ComponentBoundEvent_4_EventDispatcher_SetMicrophone__DelegateSignature
struct USoundSettings_C_BndEvt__VoiceDevice_K2Node_ComponentBoundEvent_4_EventDispatcher_SetMicrophone__DelegateSignature_Params
{
	struct FString                                     SelectedItem;                                              // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TEnumAsByte<SlateCore_ESelectInfo>                 SelectionType;                                             // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.SetVoiceDevice
struct USoundSettings_C_SetVoiceDevice_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__VoiceDevice_K2Node_ComponentBoundEvent_6_EventDispatcher_Open__DelegateSignature
struct USoundSettings_C_BndEvt__VoiceDevice_K2Node_ComponentBoundEvent_6_EventDispatcher_Open__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.Construct
struct USoundSettings_C_Construct_Params
{
};

// Function SoundSettings.SoundSettings_C.PreConstruct
struct USoundSettings_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_Button_VOIP_Boost_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_Button_VOIP_Boost_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_BG_MUSIC_K2Node_ComponentBoundEvent_12_EventDispatcher_Left__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_BG_MUSIC_K2Node_ComponentBoundEvent_12_EventDispatcher_Left__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_BG_MUSIC_K2Node_ComponentBoundEvent_13_EventDispatcher_Right__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_BG_MUSIC_K2Node_ComponentBoundEvent_13_EventDispatcher_Right__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_BG_MUSIC_K2Node_ComponentBoundEvent_15_OnPressed__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_BG_MUSIC_K2Node_ComponentBoundEvent_15_OnPressed__DelegateSignature_Params
{
	class UCustomGraphicButton_C*                      Button;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SoundSettings.SoundSettings_C.BG_MUSIC_BTNSTYLE
struct USoundSettings_C_BG_MUSIC_BTNSTYLE_Params
{
};

// Function SoundSettings.SoundSettings_C.ChangePanel
struct USoundSettings_C_ChangePanel_Params
{
	class UCustomGraphicButton_C*                      Overlay;                                                   // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                                  Title;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                                  Value;                                                     // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                      Image;                                                     // 0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                      LowBTN;                                                    // 0x0020(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                      HigthBTN;                                                  // 0x0028(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Index;                                                     // 0x0030(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Lenght;                                                    // 0x0034(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               B;                                                         // 0x0038(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_Button_186_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_Button_186_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_Button_187_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_Button_187_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_Button_188_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_Button_188_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_Button_189_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_Button_189_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_Button_Device_K2Node_ComponentBoundEvent_20_OnButtonHoverEvent__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_Button_Device_K2Node_ComponentBoundEvent_20_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.BndEvt__SoundSettings_Button_Device_K2Node_ComponentBoundEvent_21_OnButtonHoverEvent__DelegateSignature
struct USoundSettings_C_BndEvt__SoundSettings_Button_Device_K2Node_ComponentBoundEvent_21_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function SoundSettings.SoundSettings_C.ExecuteUbergraph_SoundSettings
struct USoundSettings_C_ExecuteUbergraph_SoundSettings_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
