#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function SurvivorMasterBP.SurvivorMasterBP_C.GetCurrentEXP
struct ASurvivorMasterBP_C_GetCurrentEXP_Params
{
	int                                                CurEXP;                                                    // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.GetPointsForPerks
struct ASurvivorMasterBP_C_GetPointsForPerks_Params
{
	int                                                PerkPoints;                                                // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SeeKillerSilhouetteNearHC
struct ASurvivorMasterBP_C_SeeKillerSilhouetteNearHC_Params
{
	bool                                               wannasee;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.GetPerkName
struct ASurvivorMasterBP_C_GetPerkName_Params
{
	struct FName                                       Name;                                                      // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                PerkIndex;                                                 // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.HeadRotationFunc
struct ASurvivorMasterBP_C_HeadRotationFunc_Params
{
	struct FRotator                                    Rotation;                                                  // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.StartDialogue
struct ASurvivorMasterBP_C_StartDialogue_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.DamageTypeCheck
struct ASurvivorMasterBP_C_DamageTypeCheck_Params
{
	bool                                               Clear_;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.OnRep_PerkActivated
struct ASurvivorMasterBP_C_OnRep_PerkActivated_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.PropJumpWall
struct ASurvivorMasterBP_C_PropJumpWall_Params
{
	float                                              Jump;                                                      // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.get level name
struct ASurvivorMasterBP_C_get_level_name_Params
{
	bool                                               B;                                                         // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FString                                     Name;                                                      // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CheckAndSetSkin
struct ASurvivorMasterBP_C_CheckAndSetSkin_Params
{
	int                                                SkinID;                                                    // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                               Mesh;                                                      // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Exp Score Calc
struct ASurvivorMasterBP_C_Exp_Score_Calc_Params
{
	int                                                Points;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TEnumAsByte<CoinEnum_ECoinEnum>                    CoinType;                                                  // 0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Init Max Score
struct ASurvivorMasterBP_C_Init_Max_Score_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CoinAngle
struct ASurvivorMasterBP_C_CoinAngle_Params
{
	bool                                               Server_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                              X;                                                         // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Y;                                                         // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              Z;                                                         // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.OnRep_ProgressUI
struct ASurvivorMasterBP_C_OnRep_ProgressUI_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.PassiveSkill
struct ASurvivorMasterBP_C_PassiveSkill_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.WallCheck
struct ASurvivorMasterBP_C_WallCheck_Params
{
	class AActor*                                      Actor;                                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               NewParam;                                                  // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SpeedChecker
struct ASurvivorMasterBP_C_SpeedChecker_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.DisableInDirect
struct ASurvivorMasterBP_C_DisableInDirect_Params
{
	bool                                               Up;                                                        // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InteractBoxOverlap
struct ASurvivorMasterBP_C_InteractBoxOverlap_Params
{
	class UClass*                                      ClassFilter;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                     NotEqual;                                                  // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      Actor;                                                     // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.GrapleMovement
struct ASurvivorMasterBP_C_GrapleMovement_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.HookShot
struct ASurvivorMasterBP_C_HookShot_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SelectObjectPropMove
struct ASurvivorMasterBP_C_SelectObjectPropMove_Params
{
	struct FVector                                     Velocity;                                                  // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ChangePropCollision
struct ASurvivorMasterBP_C_ChangePropCollision_Params
{
	struct FPropData                                   PropData;                                                  // 0x0000(0x0090)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.HitImpactSound
struct ASurvivorMasterBP_C_HitImpactSound_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CheckActiveActions
struct ASurvivorMasterBP_C_CheckActiveActions_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CheckFullHealthFinal
struct ASurvivorMasterBP_C_CheckFullHealthFinal_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CheckFullHealth
struct ASurvivorMasterBP_C_CheckFullHealth_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CheckZeroHealthWithoutCrawl
struct ASurvivorMasterBP_C_CheckZeroHealthWithoutCrawl_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CheckZeroHealth
struct ASurvivorMasterBP_C_CheckZeroHealth_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CheckMoved
struct ASurvivorMasterBP_C_CheckMoved_Params
{
	bool                                               PressedAndMoved;                                           // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               NotPressedAndMoved;                                        // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CalculatePersonHealth
struct ASurvivorMasterBP_C_CalculatePersonHealth_Params
{
	int                                                Health;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPropData                                   Data;                                                      // 0x0008(0x0090)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int                                                NewHealth;                                                 // 0x0098(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CalculatePropHealth
struct ASurvivorMasterBP_C_CalculatePropHealth_Params
{
	int                                                Health;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPropData                                   Data;                                                      // 0x0008(0x0090)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int                                                NewHealth;                                                 // 0x0098(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ReduceHealth
struct ASurvivorMasterBP_C_ReduceHealth_Params
{
	int                                                Damage;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                HP;                                                        // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.OnRep_SurvivalHealth
struct ASurvivorMasterBP_C_OnRep_SurvivalHealth_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.PropJump
struct ASurvivorMasterBP_C_PropJump_Params
{
	float                                              Jump;                                                      // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.OnRep_CurrentTransform
struct ASurvivorMasterBP_C_OnRep_CurrentTransform_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SetItem
struct ASurvivorMasterBP_C_SetItem_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SetItemToLastIndex
struct ASurvivorMasterBP_C_SetItemToLastIndex_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SpawnItem
struct ASurvivorMasterBP_C_SpawnItem_Params
{
	class UClass*                                      Item;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                       Pawn;                                                      // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.UserConstructionScript
struct ASurvivorMasterBP_C_UserConstructionScript_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.LerpAlphaTimeline__FinishedFunc
struct ASurvivorMasterBP_C_LerpAlphaTimeline__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.LerpAlphaTimeline__UpdateFunc
struct ASurvivorMasterBP_C_LerpAlphaTimeline__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.TimelineJump__FinishedFunc
struct ASurvivorMasterBP_C_TimelineJump__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.TimelineJump__UpdateFunc
struct ASurvivorMasterBP_C_TimelineJump__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.PPColorChange__FinishedFunc
struct ASurvivorMasterBP_C_PPColorChange__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.PPColorChange__UpdateFunc
struct ASurvivorMasterBP_C_PPColorChange__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_1__FinishedFunc
struct ASurvivorMasterBP_C_Timeline_1__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_1__UpdateFunc
struct ASurvivorMasterBP_C_Timeline_1__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.HitTimeline__FinishedFunc
struct ASurvivorMasterBP_C_HitTimeline__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.HitTimeline__UpdateFunc
struct ASurvivorMasterBP_C_HitTimeline__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Rope__FinishedFunc
struct ASurvivorMasterBP_C_Rope__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Rope__UpdateFunc
struct ASurvivorMasterBP_C_Rope__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CameraInteract__FinishedFunc
struct ASurvivorMasterBP_C_CameraInteract__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CameraInteract__UpdateFunc
struct ASurvivorMasterBP_C_CameraInteract__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.TimelineFOV__FinishedFunc
struct ASurvivorMasterBP_C_TimelineFOV__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.TimelineFOV__UpdateFunc
struct ASurvivorMasterBP_C_TimelineFOV__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CapsuleTimeline__FinishedFunc
struct ASurvivorMasterBP_C_CapsuleTimeline__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CapsuleTimeline__UpdateFunc
struct ASurvivorMasterBP_C_CapsuleTimeline__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.BlurTimeline__FinishedFunc
struct ASurvivorMasterBP_C_BlurTimeline__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.BlurTimeline__UpdateFunc
struct ASurvivorMasterBP_C_BlurTimeline__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_2__FinishedFunc
struct ASurvivorMasterBP_C_Timeline_2__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_2__UpdateFunc
struct ASurvivorMasterBP_C_Timeline_2__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.DeathEffectTimeline__FinishedFunc
struct ASurvivorMasterBP_C_DeathEffectTimeline__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.DeathEffectTimeline__UpdateFunc
struct ASurvivorMasterBP_C_DeathEffectTimeline__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.DropItemHold__FinishedFunc
struct ASurvivorMasterBP_C_DropItemHold__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.DropItemHold__UpdateFunc
struct ASurvivorMasterBP_C_DropItemHold__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_0__FinishedFunc
struct ASurvivorMasterBP_C_Timeline_0__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_0__UpdateFunc
struct ASurvivorMasterBP_C_Timeline_0__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ZoomOutTimeline__FinishedFunc
struct ASurvivorMasterBP_C_ZoomOutTimeline__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ZoomOutTimeline__UpdateFunc
struct ASurvivorMasterBP_C_ZoomOutTimeline__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_3__FinishedFunc
struct ASurvivorMasterBP_C_Timeline_3__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_3__UpdateFunc
struct ASurvivorMasterBP_C_Timeline_3__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_4__FinishedFunc
struct ASurvivorMasterBP_C_Timeline_4__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_4__UpdateFunc
struct ASurvivorMasterBP_C_Timeline_4__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_5__FinishedFunc
struct ASurvivorMasterBP_C_Timeline_5__FinishedFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Timeline_5__UpdateFunc
struct ASurvivorMasterBP_C_Timeline_5__UpdateFunc_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Jump_K2Node_InputActionEvent_18
struct ASurvivorMasterBP_C_InpActEvt_Jump_K2Node_InputActionEvent_18_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Jump_K2Node_InputActionEvent_17
struct ASurvivorMasterBP_C_InpActEvt_Jump_K2Node_InputActionEvent_17_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpTchEvt_Released
struct ASurvivorMasterBP_C_InpTchEvt_Released_Params
{
	TEnumAsByte<InputCore_ETouchIndex>                 FingerIndex;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Location;                                                  // 0x0004(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpTchEvt_Pressed
struct ASurvivorMasterBP_C_InpTchEvt_Pressed_Params
{
	TEnumAsByte<InputCore_ETouchIndex>                 FingerIndex;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Location;                                                  // 0x0004(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Run_K2Node_InputActionEvent_16
struct ASurvivorMasterBP_C_InpActEvt_Run_K2Node_InputActionEvent_16_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Run_K2Node_InputActionEvent_15
struct ASurvivorMasterBP_C_InpActEvt_Run_K2Node_InputActionEvent_15_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_NumPadOne_K2Node_InputKeyEvent_20
struct ASurvivorMasterBP_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_20_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_NumPadTwo_K2Node_InputKeyEvent_19
struct ASurvivorMasterBP_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_19_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_F5_K2Node_InputKeyEvent_18
struct ASurvivorMasterBP_C_InpActEvt_F5_K2Node_InputKeyEvent_18_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_F6_K2Node_InputKeyEvent_17
struct ASurvivorMasterBP_C_InpActEvt_F6_K2Node_InputKeyEvent_17_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_F7_K2Node_InputKeyEvent_16
struct ASurvivorMasterBP_C_InpActEvt_F7_K2Node_InputKeyEvent_16_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Graffiti_K2Node_InputActionEvent_14
struct ASurvivorMasterBP_C_InpActEvt_Graffiti_K2Node_InputActionEvent_14_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_NumPadThree_K2Node_InputKeyEvent_15
struct ASurvivorMasterBP_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_15_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_NumPadFour_K2Node_InputKeyEvent_14
struct ASurvivorMasterBP_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_14_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_NumPadFive_K2Node_InputKeyEvent_13
struct ASurvivorMasterBP_C_InpActEvt_NumPadFive_K2Node_InputKeyEvent_13_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_NumPadSix_K2Node_InputKeyEvent_12
struct ASurvivorMasterBP_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_12_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_NumPadSeven_K2Node_InputKeyEvent_11
struct ASurvivorMasterBP_C_InpActEvt_NumPadSeven_K2Node_InputKeyEvent_11_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_NumPadEight_K2Node_InputKeyEvent_10
struct ASurvivorMasterBP_C_InpActEvt_NumPadEight_K2Node_InputKeyEvent_10_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_NumPadNine_K2Node_InputKeyEvent_9
struct ASurvivorMasterBP_C_InpActEvt_NumPadNine_K2Node_InputKeyEvent_9_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_NumPadZero_K2Node_InputKeyEvent_8
struct ASurvivorMasterBP_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_8_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C. Pick Up_K2Node_InputActionEvent_13
struct ASurvivorMasterBP_C__Pick_Up_K2Node_InputActionEvent_13_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C. Pick Up_K2Node_InputActionEvent_12
struct ASurvivorMasterBP_C__Pick_Up_K2Node_InputActionEvent_12_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Turn Into Prop_K2Node_InputActionEvent_11
struct ASurvivorMasterBP_C_InpActEvt_Turn_Into_Prop_K2Node_InputActionEvent_11_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_(Prop) Turn Into Survivor_K2Node_InputActionEvent_10
struct ASurvivorMasterBP_C_InpActEvt__Prop__Turn_Into_Survivor_K2Node_InputActionEvent_10_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_(Prop) Straighten Up_K2Node_InputActionEvent_9
struct ASurvivorMasterBP_C_InpActEvt__Prop__Straighten_Up_K2Node_InputActionEvent_9_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_(Prop) Straighten Up_K2Node_InputActionEvent_8
struct ASurvivorMasterBP_C_InpActEvt__Prop__Straighten_Up_K2Node_InputActionEvent_8_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Drop Item_K2Node_InputActionEvent_7
struct ASurvivorMasterBP_C_InpActEvt_Drop_Item_K2Node_InputActionEvent_7_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Drop Item_K2Node_InputActionEvent_6
struct ASurvivorMasterBP_C_InpActEvt_Drop_Item_K2Node_InputActionEvent_6_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Voice Commands_K2Node_InputActionEvent_5
struct ASurvivorMasterBP_C_InpActEvt_Voice_Commands_K2Node_InputActionEvent_5_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Voice Commands_K2Node_InputActionEvent_4
struct ASurvivorMasterBP_C_InpActEvt_Voice_Commands_K2Node_InputActionEvent_4_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Divide_K2Node_InputKeyEvent_7
struct ASurvivorMasterBP_C_InpActEvt_Divide_K2Node_InputKeyEvent_7_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Multiply_K2Node_InputKeyEvent_6
struct ASurvivorMasterBP_C_InpActEvt_Multiply_K2Node_InputKeyEvent_6_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Use Item 1_K2Node_InputActionEvent_3
struct ASurvivorMasterBP_C_InpActEvt_Use_Item_1_K2Node_InputActionEvent_3_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Use Item 2_K2Node_InputActionEvent_2
struct ASurvivorMasterBP_C_InpActEvt_Use_Item_2_K2Node_InputActionEvent_2_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Use Item 3_K2Node_InputActionEvent_1
struct ASurvivorMasterBP_C_InpActEvt_Use_Item_3_K2Node_InputActionEvent_1_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_Add_K2Node_InputKeyEvent_5
struct ASurvivorMasterBP_C_InpActEvt_Add_K2Node_InputKeyEvent_5_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_N_K2Node_InputKeyEvent_4
struct ASurvivorMasterBP_C_InpActEvt_N_K2Node_InputKeyEvent_4_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_F8_K2Node_InputKeyEvent_3
struct ASurvivorMasterBP_C_InpActEvt_F8_K2Node_InputKeyEvent_3_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_F9_K2Node_InputKeyEvent_2
struct ASurvivorMasterBP_C_InpActEvt_F9_K2Node_InputKeyEvent_2_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpActEvt_F10_K2Node_InputKeyEvent_1
struct ASurvivorMasterBP_C_InpActEvt_F10_K2Node_InputKeyEvent_1_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.AddEXP
struct ASurvivorMasterBP_C_AddEXP_Params
{
	int                                                Exp;                                                       // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      Player;                                                    // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                        HUD;                                                       // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SetTimingToAllChairs
struct ASurvivorMasterBP_C_SetTimingToAllChairs_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SetDepth
struct ASurvivorMasterBP_C_SetDepth_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.LevelUpped
struct ASurvivorMasterBP_C_LevelUpped_Params
{
	class AActor*                                      PlayerRef;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.DecreasePerkPoints
struct ASurvivorMasterBP_C_DecreasePerkPoints_Params
{
	int                                                PerkPoints;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.AddInteractable
struct ASurvivorMasterBP_C_AddInteractable_Params
{
	class AActor*                                      Actor;                                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FName                                       InputMapping;                                              // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FText                                       Text;                                                      // 0x0010(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.RemoveInteractable
struct ASurvivorMasterBP_C_RemoveInteractable_Params
{
	class AActor*                                      Actor;                                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Chair Open Stage
struct ASurvivorMasterBP_C_Chair_Open_Stage_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SpawnDecal
struct ASurvivorMasterBP_C_SpawnDecal_Params
{
	struct FName                                       SocketName;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Right;                                                     // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Left;                                                      // 0x0009(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               JumpStart;                                                 // 0x000A(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               JumpEnd;                                                   // 0x000B(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Killer_;                                                   // 0x000C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               ImProp_;                                                   // 0x000D(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Run_;                                                      // 0x000E(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Crouch_;                                                   // 0x000F(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFMODAudioComponent*                         FMODAudio;                                                 // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                KillerType;                                                // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Crawl_;                                                    // 0x001C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Shake;                                                     // 0x001D(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.BeginFootprint
struct ASurvivorMasterBP_C_BeginFootprint_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ChangeFootState
struct ASurvivorMasterBP_C_ChangeFootState_Params
{
	TEnumAsByte<EFootState_EFootState>                 New_Style;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SetCharacterOwner
struct ASurvivorMasterBP_C_SetCharacterOwner_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ServerChangeFootwear
struct ASurvivorMasterBP_C_ServerChangeFootwear_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.MulticastChangeFootwear
struct ASurvivorMasterBP_C_MulticastChangeFootwear_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.GetSurvMesh
struct ASurvivorMasterBP_C_GetSurvMesh_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.GetPropMesh
struct ASurvivorMasterBP_C_GetPropMesh_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpAxisEvt_LookUp_K2Node_InputAxisEvent_41
struct ASurvivorMasterBP_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_41_Params
{
	float                                              AxisValue;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpAxisEvt_Turn_K2Node_InputAxisEvent_48
struct ASurvivorMasterBP_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_48_Params
{
	float                                              AxisValue;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpAxisEvt_TurnRate_K2Node_InputAxisEvent_39
struct ASurvivorMasterBP_C_InpAxisEvt_TurnRate_K2Node_InputAxisEvent_39_Params
{
	float                                              AxisValue;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.InpAxisEvt_LookUpRate_K2Node_InputAxisEvent_54
struct ASurvivorMasterBP_C_InpAxisEvt_LookUpRate_K2Node_InputAxisEvent_54_Params
{
	float                                              AxisValue;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.MovementSpeed
struct ASurvivorMasterBP_C_MovementSpeed_Params
{
	float                                              MovForward;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SetMovementType
struct ASurvivorMasterBP_C_SetMovementType_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ReceiveTick
struct ASurvivorMasterBP_C_ReceiveTick_Params
{
	float                                              DeltaSeconds;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.RotateEvent
struct ASurvivorMasterBP_C_RotateEvent_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.Prop
struct ASurvivorMasterBP_C_Prop_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ServerPerson
struct ASurvivorMasterBP_C_ServerPerson_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.MulticastPerson
struct ASurvivorMasterBP_C_MulticastPerson_Params
{
	struct FVector                                     Vector;                                                    // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Temp2Vector;                                               // 0x000C(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ServerProp
struct ASurvivorMasterBP_C_ServerProp_Params
{
	class AActor*                                      HitActor;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ItemMovementEvent
struct ASurvivorMasterBP_C_ItemMovementEvent_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SetVectors
struct ASurvivorMasterBP_C_SetVectors_Params
{
	struct FVector                                     Forward;                                                   // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Right;                                                     // 0x000C(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                                    AxisRotator;                                               // 0x0018(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.MulticastProp
struct ASurvivorMasterBP_C_MulticastProp_Params
{
	class AActor*                                      HitActor;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ReceiveBeginPlay
struct ASurvivorMasterBP_C_ReceiveBeginPlay_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.HittedMulticast
struct ASurvivorMasterBP_C_HittedMulticast_Params
{
	int                                                Damage;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                TrueDamage;                                                // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TEnumAsByte<DamageTypeEnum_EDamageTypeEnum>        DamageType;                                                // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               Moved_;                                                    // 0x0009(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               Invulnerability_;                                          // 0x000A(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.test1
struct ASurvivorMasterBP_C_test1_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.test1multi
struct ASurvivorMasterBP_C_test1multi_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SetMoveFloat
struct ASurvivorMasterBP_C_SetMoveFloat_Params
{
	float                                              RightLeft;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.DeathServer
struct ASurvivorMasterBP_C_DeathServer_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.DeathMulticast
struct ASurvivorMasterBP_C_DeathMulticast_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.GetOutServer
struct ASurvivorMasterBP_C_GetOutServer_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ItemSlotUpdate
struct ASurvivorMasterBP_C_ItemSlotUpdate_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ItemSwitch
struct ASurvivorMasterBP_C_ItemSwitch_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.SurvAbility
struct ASurvivorMasterBP_C_SurvAbility_Params
{
	struct FString                                     In;                                                        // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.StartGrapple
struct ASurvivorMasterBP_C_StartGrapple_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.StopGrapple
struct ASurvivorMasterBP_C_StopGrapple_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ServExittedDoor
struct ASurvivorMasterBP_C_ServExittedDoor_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.DropSurvivor
struct ASurvivorMasterBP_C_DropSurvivor_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.PickUpSurvivor
struct ASurvivorMasterBP_C_PickUpSurvivor_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
struct ASurvivorMasterBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature_Params
{
	class UPrimitiveComponent*                         OverlappedComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      OtherActor;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                OtherBodyIndex;                                            // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               bFromSweep;                                                // 0x001C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                                  SweepResult;                                               // 0x0020(0x008C)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
struct ASurvivorMasterBP_C_BndEvt__Box_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature_Params
{
	class UPrimitiveComponent*                         OverlappedComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      OtherActor;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                OtherBodyIndex;                                            // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature
struct ASurvivorMasterBP_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature_Params
{
	class UPrimitiveComponent*                         OverlappedComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      OtherActor;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                OtherBodyIndex;                                            // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               bFromSweep;                                                // 0x001C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                                  SweepResult;                                               // 0x0020(0x008C)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature
struct ASurvivorMasterBP_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature_Params
{
	class UPrimitiveComponent*                         OverlappedComponent;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      OtherActor;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                OtherBodyIndex;                                            // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CheckUpdateInteractable
struct ASurvivorMasterBP_C_CheckUpdateInteractable_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CalculateFlashlightUpdate
struct ASurvivorMasterBP_C_CalculateFlashlightUpdate_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.RotateInteractable
struct ASurvivorMasterBP_C_RotateInteractable_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ChairBreakFreeInteractable
struct ASurvivorMasterBP_C_ChairBreakFreeInteractable_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.ServerMovementType
struct ASurvivorMasterBP_C_ServerMovementType_Params
{
	TEnumAsByte<MovementTypeEnum_EMovementTypeEnum>    Type;                                                      // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.MulticastMovementType
struct ASurvivorMasterBP_C_MulticastMovementType_Params
{
	TEnumAsByte<MovementTypeEnum_EMovementTypeEnum>    Type;                                                      // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.CheckPressedAndMoved
struct ASurvivorMasterBP_C_CheckPressedAndMoved_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.StaminaDecrease
struct ASurvivorMasterBP_C_StaminaDecrease_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.StaminaIncrease
struct ASurvivorMasterBP_C_StaminaIncrease_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.VelocityCheck
struct ASurvivorMasterBP_C_VelocityCheck_Params
{
};

// Function SurvivorMasterBP.SurvivorMasterBP_C.BndEvt__PlayerStaticMesh_K2Node_ComponentBoundEvent_6_ComponentHitSignature__DelegateSignature
struct ASurvivorMasterBP_C_BndEvt__PlayerStaticMesh_K2Node_ComponentBoundEvent_6_ComponentHitSignature__DelegateSignature_Params
{
	class UPrimitiveComponent*                         HitComponent;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      OtherActor;                                                // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
