#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.GetVisibility_Button
struct USurvivalProgressBarWidget_C_GetVisibility_Button_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.SetWiggleText
struct USurvivalProgressBarWidget_C_SetWiggleText_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.Get_Progress_2_Percent_1
struct USurvivalProgressBarWidget_C_Get_Progress_2_Percent_1_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.OnRep_NeedMoreSpeed
struct USurvivalProgressBarWidget_C_OnRep_NeedMoreSpeed_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.GetPressedKey
struct USurvivalProgressBarWidget_C_GetPressedKey_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.Get_Crosshair_Brush_1
struct USurvivalProgressBarWidget_C_Get_Crosshair_Brush_1_Params
{
	struct FSlateBrush                                 ReturnValue;                                               // 0x0000(0x0088)  (Parm, OutParm, ReturnParm)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.CheckPlayerStatus
struct USurvivalProgressBarWidget_C_CheckPlayerStatus_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.GetProgressPercent
struct USurvivalProgressBarWidget_C_GetProgressPercent_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartHeal
struct USurvivalProgressBarWidget_C_StartHeal_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartReanimate
struct USurvivalProgressBarWidget_C_StartReanimate_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartHelp
struct USurvivalProgressBarWidget_C_StartHelp_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartOpen
struct USurvivalProgressBarWidget_C_StartOpen_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StopProgressBar
struct USurvivalProgressBarWidget_C_StopProgressBar_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartGetOut
struct USurvivalProgressBarWidget_C_StartGetOut_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartBreakFree
struct USurvivalProgressBarWidget_C_StartBreakFree_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.ShowGrappleButtons
struct USurvivalProgressBarWidget_C_ShowGrappleButtons_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.HideGrappleButtons
struct USurvivalProgressBarWidget_C_HideGrappleButtons_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.Tick
struct USurvivalProgressBarWidget_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartSelfReanimate
struct USurvivalProgressBarWidget_C_StartSelfReanimate_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.ChangeColor
struct USurvivalProgressBarWidget_C_ChangeColor_Params
{
	bool                                               Change_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartPullOut
struct USurvivalProgressBarWidget_C_StartPullOut_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.PressButtonA
struct USurvivalProgressBarWidget_C_PressButtonA_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartListenButtonsGrapple
struct USurvivalProgressBarWidget_C_StartListenButtonsGrapple_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.PressButtonD
struct USurvivalProgressBarWidget_C_PressButtonD_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StopListenButtonsGrapple
struct USurvivalProgressBarWidget_C_StopListenButtonsGrapple_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.Construct
struct USurvivalProgressBarWidget_C_Construct_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartPicklock
struct USurvivalProgressBarWidget_C_StartPicklock_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.SpectatorGetPlayer
struct USurvivalProgressBarWidget_C_SpectatorGetPlayer_Params
{
	bool                                               Clear_;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.BoostedChangeColor
struct USurvivalProgressBarWidget_C_BoostedChangeColor_Params
{
	bool                                               IsAlarm_;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.CheckStatusIcons
struct USurvivalProgressBarWidget_C_CheckStatusIcons_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.SetCountSurvAlarm
struct USurvivalProgressBarWidget_C_SetCountSurvAlarm_Params
{
	int                                                CountSurvAlarm;                                            // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.ClearStyleGrappleButtons
struct USurvivalProgressBarWidget_C_ClearStyleGrappleButtons_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.AlarmFailed
struct USurvivalProgressBarWidget_C_AlarmFailed_Params
{
	float                                              Percent;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.AlarmSuccessed
struct USurvivalProgressBarWidget_C_AlarmSuccessed_Params
{
	float                                              OldPercent;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              NewParam;                                                  // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Level;                                                     // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.AlarmFailed_Tick
struct USurvivalProgressBarWidget_C_AlarmFailed_Tick_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartReloadingAlarm
struct USurvivalProgressBarWidget_C_StartReloadingAlarm_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.PreConstruct
struct USurvivalProgressBarWidget_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.AlarmSuccessed_Tick
struct USurvivalProgressBarWidget_C_AlarmSuccessed_Tick_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.SurvOnChair
struct USurvivalProgressBarWidget_C_SurvOnChair_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.StartHoudini
struct USurvivalProgressBarWidget_C_StartHoudini_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.Tinkerer
struct USurvivalProgressBarWidget_C_Tinkerer_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.HitMark
struct USurvivalProgressBarWidget_C_HitMark_Params
{
	struct FVector                                     InstigatorLocation;                                        // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.MovePB
struct USurvivalProgressBarWidget_C_MovePB_Params
{
};

// Function SurvivalProgressBarWidget.SurvivalProgressBarWidget_C.ExecuteUbergraph_SurvivalProgressBarWidget
struct USurvivalProgressBarWidget_C_ExecuteUbergraph_SurvivalProgressBarWidget_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
