#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function TutorialTrigger.TutorialTrigger_C.ReceiveActorBeginOverlap
struct ATutorialTrigger_C_ReceiveActorBeginOverlap_Params
{
	class AActor*                                      OtherActor;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TutorialTrigger.TutorialTrigger_C.DoorTriggerEvent
struct ATutorialTrigger_C_DoorTriggerEvent_Params
{
	class UObject*                                     Object;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function TutorialTrigger.TutorialTrigger_C.SurvPart2-2Event
struct ATutorialTrigger_C_SurvPart2_2Event_Params
{
	class UObject*                                     Object;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function TutorialTrigger.TutorialTrigger_C.SurvPart2-1Event
struct ATutorialTrigger_C_SurvPart2_1Event_Params
{
	class UObject*                                     Object;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function TutorialTrigger.TutorialTrigger_C.QuestEvent
struct ATutorialTrigger_C_QuestEvent_Params
{
};

// Function TutorialTrigger.TutorialTrigger_C.Surv
struct ATutorialTrigger_C_Surv_Params
{
};

// Function TutorialTrigger.TutorialTrigger_C.ExecuteUbergraph_TutorialTrigger
struct ATutorialTrigger_C_ExecuteUbergraph_TutorialTrigger_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
