#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function W_CustomizeBanner.W_CustomizeBanner_C.SetButtonsIfNoItems_Avatar
struct UW_CustomizeBanner_C_SetButtonsIfNoItems_Avatar_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.SetBGAvatar
struct UW_CustomizeBanner_C_SetBGAvatar_Params
{
	class UDataTable*                                  DataTable;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FName                                       RowName;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                A;                                                         // 0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.SetButtonsIfNoItems_Banner
struct UW_CustomizeBanner_C_SetButtonsIfNoItems_Banner_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.SetBGBanner
struct UW_CustomizeBanner_C_SetBGBanner_Params
{
	class UDataTable*                                  DataTable;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FName                                       RowName;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                A;                                                         // 0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.OnLoaded_8E7DAA2C47C27AB2CFF826B052593BD6
struct UW_CustomizeBanner_C_OnLoaded_8E7DAA2C47C27AB2CFF826B052593BD6_Params
{
	class UObject*                                     Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.OnLoaded_2303DE2048421C90560F9EA0ACF3AA96
struct UW_CustomizeBanner_C_OnLoaded_2303DE2048421C90560F9EA0ACF3AA96_Params
{
	class UObject*                                     Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.OnLoaded_9A4187704EE17DB5FB89CEB88F91A307
struct UW_CustomizeBanner_C_OnLoaded_9A4187704EE17DB5FB89CEB88F91A307_Params
{
	class UObject*                                     Loaded;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.Construct
struct UW_CustomizeBanner_C_Construct_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.BannerOnClicked
struct UW_CustomizeBanner_C_BannerOnClicked_Params
{
	class UW_CustomizeBannerInfo_C*                    CustomizebannerInfo;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.TagOnClicked
struct UW_CustomizeBanner_C_TagOnClicked_Params
{
	class UW_CutomizeTagInfo_C*                        Tags;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.AvatarInfo_Clicked
struct UW_CustomizeBanner_C_AvatarInfo_Clicked_Params
{
	class UW_CustomizeAvatarInfo_C*                    CustomizebannerInfo;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.BndEvt__W_CustomizeBanner_Button_Audio_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature
struct UW_CustomizeBanner_C_BndEvt__W_CustomizeBanner_Button_Audio_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.BndEvt__W_CustomizeBanner_Button_Control_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature
struct UW_CustomizeBanner_C_BndEvt__W_CustomizeBanner_Button_Control_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.BndEvt__W_CustomizeBanner_Button_Graphic_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature
struct UW_CustomizeBanner_C_BndEvt__W_CustomizeBanner_Button_Graphic_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.FirstStyle
struct UW_CustomizeBanner_C_FirstStyle_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.BndEvt__W_CustomizeBanner_Button_Graphic_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
struct UW_CustomizeBanner_C_BndEvt__W_CustomizeBanner_Button_Graphic_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.BndEvt__W_CustomizeBanner_Button_Graphic_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
struct UW_CustomizeBanner_C_BndEvt__W_CustomizeBanner_Button_Graphic_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.BndEvt__W_CustomizeBanner_Button_Control_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature
struct UW_CustomizeBanner_C_BndEvt__W_CustomizeBanner_Button_Control_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.BndEvt__W_CustomizeBanner_Button_Control_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature
struct UW_CustomizeBanner_C_BndEvt__W_CustomizeBanner_Button_Control_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.BndEvt__W_CustomizeBanner_Button_Audio_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature
struct UW_CustomizeBanner_C_BndEvt__W_CustomizeBanner_Button_Audio_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.BndEvt__W_CustomizeBanner_Button_Audio_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature
struct UW_CustomizeBanner_C_BndEvt__W_CustomizeBanner_Button_Audio_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_CustomizeBanner.W_CustomizeBanner_C.ExecuteUbergraph_W_CustomizeBanner
struct UW_CustomizeBanner_C_ExecuteUbergraph_W_CustomizeBanner_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
