#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function W_LobbySurv.W_LobbySurv_C.BndEvt__W_LobbySurv_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UW_LobbySurv_C_BndEvt__W_LobbySurv_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_LobbySurv.W_LobbySurv_C.AnimDOWN
struct UW_LobbySurv_C_AnimDOWN_Params
{
};

// Function W_LobbySurv.W_LobbySurv_C.BndEvt__W_LobbySurv_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
struct UW_LobbySurv_C_BndEvt__W_LobbySurv_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_LobbySurv.W_LobbySurv_C.SetButtonInfoSkill
struct UW_LobbySurv_C_SetButtonInfoSkill_Params
{
	TEnumAsByte<SurvSkills_ESurvSkills>                Skill;                                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_MiniLobby_C*                              Owner;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_LobbySurv.W_LobbySurv_C.SetFirst
struct UW_LobbySurv_C_SetFirst_Params
{
};

// Function W_LobbySurv.W_LobbySurv_C.SetButtonInfo
struct UW_LobbySurv_C_SetButtonInfo_Params
{
	TEnumAsByte<SurvClass_ESurvClass>                  Class;                                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_MiniLobby_C*                              Owner;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TEnumAsByte<SurvChars_ESurvChars>                  char_;                                                     // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_LobbySurv.W_LobbySurv_C.ResetButton
struct UW_LobbySurv_C_ResetButton_Params
{
};

// Function W_LobbySurv.W_LobbySurv_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
struct UW_LobbySurv_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function W_LobbySurv.W_LobbySurv_C.Tick
struct UW_LobbySurv_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_LobbySurv.W_LobbySurv_C.Construct
struct UW_LobbySurv_C_Construct_Params
{
};

// Function W_LobbySurv.W_LobbySurv_C.ExecuteUbergraph_W_LobbySurv
struct UW_LobbySurv_C_ExecuteUbergraph_W_LobbySurv_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
