#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.GetContentHeight
struct UW_PlayCardContent_CustomGame_C_GetContentHeight_Params
{
	float                                              Height;                                                    // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.GetTextContentHeight
struct UW_PlayCardContent_CustomGame_C_GetTextContentHeight_Params
{
	float                                              Height;                                                    // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.Construct
struct UW_PlayCardContent_CustomGame_C_Construct_Params
{
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.Tick
struct UW_PlayCardContent_CustomGame_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.OnInit
struct UW_PlayCardContent_CustomGame_C_OnInit_Params
{
	struct FText                                       Name;                                                      // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FText                                       Description;                                               // 0x0018(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.BndEvt__W_PlayCardContent_CustomGame_Button_CreateGame_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UW_PlayCardContent_CustomGame_C_BndEvt__W_PlayCardContent_CustomGame_Button_CreateGame_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.BndEvt__W_PlayCardContent_CustomGame_Button_CreateGame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UW_PlayCardContent_CustomGame_C_BndEvt__W_PlayCardContent_CustomGame_Button_CreateGame_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.BndEvt__W_PlayCardContent_CustomGame_Button_ServerBrowser_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
struct UW_PlayCardContent_CustomGame_C_BndEvt__W_PlayCardContent_CustomGame_Button_ServerBrowser_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.BndEvt__W_PlayCardContent_CustomGame_Button_ServerBrowser_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
struct UW_PlayCardContent_CustomGame_C_BndEvt__W_PlayCardContent_CustomGame_Button_ServerBrowser_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.BndEvt__W_PlayCardContent_CustomGame_Button_CreateGame_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature
struct UW_PlayCardContent_CustomGame_C_BndEvt__W_PlayCardContent_CustomGame_Button_CreateGame_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.BndEvt__W_PlayCardContent_CustomGame_Button_ServerBrowser_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature
struct UW_PlayCardContent_CustomGame_C_BndEvt__W_PlayCardContent_CustomGame_Button_ServerBrowser_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.LockingLogic
struct UW_PlayCardContent_CustomGame_C_LockingLogic_Params
{
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.ExecuteUbergraph_W_PlayCardContent_CustomGame
struct UW_PlayCardContent_CustomGame_C_ExecuteUbergraph_W_PlayCardContent_CustomGame_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.ServerBrowser_OnClicked__DelegateSignature
struct UW_PlayCardContent_CustomGame_C_ServerBrowser_OnClicked__DelegateSignature_Params
{
};

// Function W_PlayCardContent_CustomGame.W_PlayCardContent_CustomGame_C.CreateGame_OnClicked__DelegateSignature
struct UW_PlayCardContent_CustomGame_C_CreateGame_OnClicked__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
