#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function W_PrivateGame.W_PrivateGame_C.CreatePassView
struct UW_PrivateGame_C_CreatePassView_Params
{
	int                                                SymNum;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FString                                     Result;                                                    // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};

// Function W_PrivateGame.W_PrivateGame_C.BndEvt__W_PrivateGame_Button_JoinPrivate_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UW_PrivateGame_C_BndEvt__W_PrivateGame_Button_JoinPrivate_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.BndEvt__W_PrivateGame_Button_JoinServer_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
struct UW_PrivateGame_C_BndEvt__W_PrivateGame_Button_JoinServer_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.WrongPassword
struct UW_PrivateGame_C_WrongPassword_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.RightPassword
struct UW_PrivateGame_C_RightPassword_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.Construct
struct UW_PrivateGame_C_Construct_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.BndEvt__W_PrivateGame_Button_287_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UW_PrivateGame_C_BndEvt__W_PrivateGame_Button_287_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UW_PrivateGame_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.BndEvt__Button_JoinServer_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
struct UW_PrivateGame_C_BndEvt__Button_JoinServer_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.OnFailed
struct UW_PrivateGame_C_OnFailed_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.OnSuccessed
struct UW_PrivateGame_C_OnSuccessed_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.PlayShowAnim
struct UW_PrivateGame_C_PlayShowAnim_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.PlayHideAnim
struct UW_PrivateGame_C_PlayHideAnim_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.Cancel
struct UW_PrivateGame_C_Cancel_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.Join
struct UW_PrivateGame_C_Join_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.BndEvt__W_PrivateGame_EditableTextBox_Password_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature
struct UW_PrivateGame_C_BndEvt__W_PrivateGame_EditableTextBox_Password_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature_Params
{
	struct FText                                       Text;                                                      // 0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TEnumAsByte<SlateCore_ETextCommit>                 CommitMethod;                                              // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_PrivateGame.W_PrivateGame_C.BndEvt__W_PrivateGame_Button_Cancel_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
struct UW_PrivateGame_C_BndEvt__W_PrivateGame_Button_Cancel_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function W_PrivateGame.W_PrivateGame_C.BndEvt__W_PrivateGame_EditableTextBox_Password_K2Node_ComponentBoundEvent_7_OnEditableTextBoxChangedEvent__DelegateSignature
struct UW_PrivateGame_C_BndEvt__W_PrivateGame_EditableTextBox_Password_K2Node_ComponentBoundEvent_7_OnEditableTextBoxChangedEvent__DelegateSignature_Params
{
	struct FText                                       Text;                                                      // 0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function W_PrivateGame.W_PrivateGame_C.PreConstruct
struct UW_PrivateGame_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function W_PrivateGame.W_PrivateGame_C.ExecuteUbergraph_W_PrivateGame
struct UW_PrivateGame_C_ExecuteUbergraph_W_PrivateGame_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
