#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.OnKeyDown
struct UWB_IdenticalBindsDialog_C_OnKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0038(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0070(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.BndEvt__WBP_QuitDialog_Button_No_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature
struct UWB_IdenticalBindsDialog_C_BndEvt__WBP_QuitDialog_Button_No_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
struct UWB_IdenticalBindsDialog_C_BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.PlayShowAnim
struct UWB_IdenticalBindsDialog_C_PlayShowAnim_Params
{
	bool                                               WithBlur;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.PlayHideAnim
struct UWB_IdenticalBindsDialog_C_PlayHideAnim_Params
{
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
struct UWB_IdenticalBindsDialog_C_BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.BndEvt__WBP_QuitDialog_Button_No_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
struct UWB_IdenticalBindsDialog_C_BndEvt__WBP_QuitDialog_Button_No_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.Construct
struct UWB_IdenticalBindsDialog_C_Construct_Params
{
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
struct UWB_IdenticalBindsDialog_C_BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.PreConstruct
struct UWB_IdenticalBindsDialog_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.OnAccept_Event
struct UWB_IdenticalBindsDialog_C_OnAccept_Event_Params
{
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.OnDecline_Event
struct UWB_IdenticalBindsDialog_C_OnDecline_Event_Params
{
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.Tick
struct UWB_IdenticalBindsDialog_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.ExecuteUbergraph_WB_IdenticalBindsDialog
struct UWB_IdenticalBindsDialog_C_ExecuteUbergraph_WB_IdenticalBindsDialog_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.OnDecline__DelegateSignature
struct UWB_IdenticalBindsDialog_C_OnDecline__DelegateSignature_Params
{
};

// Function WB_IdenticalBindsDialog.WB_IdenticalBindsDialog_C.OnAccept__DelegateSignature
struct UWB_IdenticalBindsDialog_C_OnAccept__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
