#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WB_KeyBindings.WB_KeyBindings_C.PreConstruct
struct UWB_KeyBindings_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_KeyBindings.WB_KeyBindings_C.Construct
struct UWB_KeyBindings_C_Construct_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.BndEvt__WB_KeyBindings_Button_DefaultCfg_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UWB_KeyBindings_C_BndEvt__WB_KeyBindings_Button_DefaultCfg_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.InitCfgInput
struct UWB_KeyBindings_C_InitCfgInput_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.BacktoDefaultPress
struct UWB_KeyBindings_C_BacktoDefaultPress_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.BacktoDefaultReleas
struct UWB_KeyBindings_C_BacktoDefaultReleas_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.ClickEventDefCFG
struct UWB_KeyBindings_C_ClickEventDefCFG_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.Tick
struct UWB_KeyBindings_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_KeyBindings.WB_KeyBindings_C.BndEvt__WB_KeyBindings_Button_DefaultCfg_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature
struct UWB_KeyBindings_C_BndEvt__WB_KeyBindings_Button_DefaultCfg_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.BndEvt__WB_KeyBindings_Button_DefaultCfg_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature
struct UWB_KeyBindings_C_BndEvt__WB_KeyBindings_Button_DefaultCfg_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.Wave_def0
struct UWB_KeyBindings_C_Wave_def0_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.Wave_def1
struct UWB_KeyBindings_C_Wave_def1_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.StopListenMenu_ButtonReset
struct UWB_KeyBindings_C_StopListenMenu_ButtonReset_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.StartListenMenu_ButtonReset
struct UWB_KeyBindings_C_StartListenMenu_ButtonReset_Params
{
};

// Function WB_KeyBindings.WB_KeyBindings_C.ExecuteUbergraph_WB_KeyBindings
struct UWB_KeyBindings_C_ExecuteUbergraph_WB_KeyBindings_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_KeyBindings.WB_KeyBindings_C.BlockedBind__DelegateSignature
struct UWB_KeyBindings_C_BlockedBind__DelegateSignature_Params
{
	bool                                               Blocked_;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
