#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_LootboxMain.WBP_LootboxMain_C.ThrobberToButton
struct UWBP_LootboxMain_C_ThrobberToButton_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.ButtonToThrobber
struct UWBP_LootboxMain_C_ButtonToThrobber_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.ControlESC
struct UWBP_LootboxMain_C_ControlESC_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.GetAvailableBropBoxes_Bind
struct UWBP_LootboxMain_C_GetAvailableBropBoxes_Bind_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.GetMoney_Bind
struct UWBP_LootboxMain_C_GetMoney_Bind_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.Finished_5F3C66E5498868C9C562758BBA373196
struct UWBP_LootboxMain_C_Finished_5F3C66E5498868C9C562758BBA373196_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.Finished_7CB50CBD42E0ED07A3A574BF79308352
struct UWBP_LootboxMain_C_Finished_7CB50CBD42E0ED07A3A574BF79308352_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.Finished_879D1B8C4971AB9D94830BB0A9809F31
struct UWBP_LootboxMain_C_Finished_879D1B8C4971AB9D94830BB0A9809F31_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.Finished_73BE465F4DF8E65AB351CCAB6270E05C
struct UWBP_LootboxMain_C_Finished_73BE465F4DF8E65AB351CCAB6270E05C_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.Construct
struct UWBP_LootboxMain_C_Construct_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.BndEvt__WBP_LootboxMain_Button_start_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UWBP_LootboxMain_C_BndEvt__WBP_LootboxMain_Button_start_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.BndEvt__WBP_LootboxMain_Button_start_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UWBP_LootboxMain_C_BndEvt__WBP_LootboxMain_Button_start_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.BndEvt__WBP_LootboxMain_Button_start_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UWBP_LootboxMain_C_BndEvt__WBP_LootboxMain_Button_start_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.InitLootboxPage
struct UWBP_LootboxMain_C_InitLootboxPage_Params
{
	class UWidget*                                     InitializerWidget;                                         // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.Move
struct UWBP_LootboxMain_C_Move_Params
{
	struct FName                                       EntryName;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.MoveToMainMenu
struct UWBP_LootboxMain_C_MoveToMainMenu_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.MoveToLootboxMenu
struct UWBP_LootboxMain_C_MoveToLootboxMenu_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.BuyLootbox
struct UWBP_LootboxMain_C_BuyLootbox_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.BndEvt__WBP_LootboxMain_Button_Clear_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
struct UWBP_LootboxMain_C_BndEvt__WBP_LootboxMain_Button_Clear_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.BndEvt__WBP_LootboxMain_Button_Add_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
struct UWBP_LootboxMain_C_BndEvt__WBP_LootboxMain_Button_Add_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.PreConstruct
struct UWBP_LootboxMain_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_LootboxMain.WBP_LootboxMain_C.ExecuteUbergraph_WBP_LootboxMain
struct UWBP_LootboxMain_C_ExecuteUbergraph_WBP_LootboxMain_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
