#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_SocialUI.WBP_SocialUI_C.IsInTeam
struct UWBP_SocialUI_C_IsInTeam_Params
{
	bool                                               In;                                                        // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_SocialUI.WBP_SocialUI_C.BndEvt__WBP_SocialUI_Button_Hide_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
struct UWBP_SocialUI_C_BndEvt__WBP_SocialUI_Button_Hide_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function WBP_SocialUI.WBP_SocialUI_C.BndEvt__WBP_SocialUI_Button_Hide_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
struct UWBP_SocialUI_C_BndEvt__WBP_SocialUI_Button_Hide_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function WBP_SocialUI.WBP_SocialUI_C.OnUserEnterLobby
struct UWBP_SocialUI_C_OnUserEnterLobby_Params
{
	struct FString                                     Name;                                                      // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FString                                     SteamId;                                                   // 0x0010(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function WBP_SocialUI.WBP_SocialUI_C.OnUserLeftLobby
struct UWBP_SocialUI_C_OnUserLeftLobby_Params
{
	struct FString                                     Name;                                                      // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FString                                     SteamId;                                                   // 0x0010(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function WBP_SocialUI.WBP_SocialUI_C.AutoClose
struct UWBP_SocialUI_C_AutoClose_Params
{
};

// Function WBP_SocialUI.WBP_SocialUI_C.BndEvt__WBP_SocialUI_WBP_MiniFriendList_K2Node_ComponentBoundEvent_0_OnButtonPressed__DelegateSignature
struct UWBP_SocialUI_C_BndEvt__WBP_SocialUI_WBP_MiniFriendList_K2Node_ComponentBoundEvent_0_OnButtonPressed__DelegateSignature_Params
{
};

// Function WBP_SocialUI.WBP_SocialUI_C.Tick
struct UWBP_SocialUI_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_SocialUI.WBP_SocialUI_C.Construct
struct UWBP_SocialUI_C_Construct_Params
{
};

// Function WBP_SocialUI.WBP_SocialUI_C.LeavePressed
struct UWBP_SocialUI_C_LeavePressed_Params
{
};

// Function WBP_SocialUI.WBP_SocialUI_C.BndEvt__WBP_SocialUI_WBP_LeaveTeamDialog_358_K2Node_ComponentBoundEvent_1_OnLeaveLobby__DelegateSignature
struct UWBP_SocialUI_C_BndEvt__WBP_SocialUI_WBP_LeaveTeamDialog_358_K2Node_ComponentBoundEvent_1_OnLeaveLobby__DelegateSignature_Params
{
};

// Function WBP_SocialUI.WBP_SocialUI_C.ExecuteUbergraph_WBP_SocialUI
struct UWBP_SocialUI_C_ExecuteUbergraph_WBP_SocialUI_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_SocialUI.WBP_SocialUI_C.OnHideDetailed__DelegateSignature
struct UWBP_SocialUI_C_OnHideDetailed__DelegateSignature_Params
{
};

// Function WBP_SocialUI.WBP_SocialUI_C.OnShowDetailed__DelegateSignature
struct UWBP_SocialUI_C_OnShowDetailed__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
