#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_MiniFriendEntry_ForList.WBP_MiniFriendEntry_ForList_C.GetText_1
struct UWBP_MiniFriendEntry_ForList_C_GetText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function WBP_MiniFriendEntry_ForList.WBP_MiniFriendEntry_ForList_C.SetIsOnline
struct UWBP_MiniFriendEntry_ForList_C_SetIsOnline_Params
{
	bool                                               IsOnline;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_MiniFriendEntry_ForList.WBP_MiniFriendEntry_ForList_C.PreConstruct
struct UWBP_MiniFriendEntry_ForList_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_MiniFriendEntry_ForList.WBP_MiniFriendEntry_ForList_C.Tick
struct UWBP_MiniFriendEntry_ForList_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_MiniFriendEntry_ForList.WBP_MiniFriendEntry_ForList_C.ExecuteUbergraph_WBP_MiniFriendEntry_ForList
struct UWBP_MiniFriendEntry_ForList_C_ExecuteUbergraph_WBP_MiniFriendEntry_ForList_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
