#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_MiniFriendEntry.WBP_MiniFriendEntry_C.Get_Text_1
struct UWBP_MiniFriendEntry_C_Get_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function WBP_MiniFriendEntry.WBP_MiniFriendEntry_C.GetIsOwner
struct UWBP_MiniFriendEntry_C_GetIsOwner_Params
{
	bool                                               IsOwner;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_MiniFriendEntry.WBP_MiniFriendEntry_C.SetIsCrowned
struct UWBP_MiniFriendEntry_C_SetIsCrowned_Params
{
	bool                                               IsCrowned;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_MiniFriendEntry.WBP_MiniFriendEntry_C.SetIsOnline
struct UWBP_MiniFriendEntry_C_SetIsOnline_Params
{
	bool                                               IsOnline;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_MiniFriendEntry.WBP_MiniFriendEntry_C.PreConstruct
struct UWBP_MiniFriendEntry_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_MiniFriendEntry.WBP_MiniFriendEntry_C.BndEvt__WBP_MiniFriendEntry_Button_123_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UWBP_MiniFriendEntry_C_BndEvt__WBP_MiniFriendEntry_Button_123_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function WBP_MiniFriendEntry.WBP_MiniFriendEntry_C.BndEvt__WBP_MiniFriendEntry_Button_123_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UWBP_MiniFriendEntry_C_BndEvt__WBP_MiniFriendEntry_Button_123_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function WBP_MiniFriendEntry.WBP_MiniFriendEntry_C.ExecuteUbergraph_WBP_MiniFriendEntry
struct UWBP_MiniFriendEntry_C_ExecuteUbergraph_WBP_MiniFriendEntry_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
