#pragma once

// Name: P, Version: 1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_QuitDialog.WBP_QuitDialog_C.OnKeyDown
struct UWBP_QuitDialog_C_OnKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0038(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0070(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.BndEvt__WBP_QuitDialog_Button_No_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature
struct UWBP_QuitDialog_C_BndEvt__WBP_QuitDialog_Button_No_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
struct UWBP_QuitDialog_C_BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.PlayShowAnim
struct UWBP_QuitDialog_C_PlayShowAnim_Params
{
	bool                                               WithBlur;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.PlayHideAnim
struct UWBP_QuitDialog_C_PlayHideAnim_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
struct UWBP_QuitDialog_C_BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.BndEvt__WBP_QuitDialog_Button_No_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
struct UWBP_QuitDialog_C_BndEvt__WBP_QuitDialog_Button_No_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.Construct
struct UWBP_QuitDialog_C_Construct_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
struct UWBP_QuitDialog_C_BndEvt__WBP_QuitDialog_Button_Yes_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.PreConstruct
struct UWBP_QuitDialog_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.OnAccept_Event
struct UWBP_QuitDialog_C_OnAccept_Event_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.OnDecline_Event
struct UWBP_QuitDialog_C_OnDecline_Event_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.Tick
struct UWBP_QuitDialog_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.ApplyUpdateStyle
struct UWBP_QuitDialog_C_ApplyUpdateStyle_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.ExecuteUbergraph_WBP_QuitDialog
struct UWBP_QuitDialog_C_ExecuteUbergraph_WBP_QuitDialog_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.OnDecline__DelegateSignature
struct UWBP_QuitDialog_C_OnDecline__DelegateSignature_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.OnAccept__DelegateSignature
struct UWBP_QuitDialog_C_OnAccept__DelegateSignature_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.OnAcceptDelayed__DelegateSignature
struct UWBP_QuitDialog_C_OnAcceptDelayed__DelegateSignature_Params
{
};

// Function WBP_QuitDialog.WBP_QuitDialog_C.OnDeclineDelayed__DelegateSignature
struct UWBP_QuitDialog_C_OnDeclineDelayed__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
